/* Keyboard Maestro localizable strings */

MWAllMacros= "所有的宏";
MWAllActions= "所有动作";
MWFavoritesActions= "收藏夹";

kmDeleteButton= "删除";
kmCancelButton= "取消";
kmOKButton= "好";
kmTryButton= "调试";
kmTryNButton= "调试%d动作";
kmViewButton= "视图";
kmMoveButton= "移动";
kmSaveButton= "保存";
kmRestoreButton= "移动";

kmEnableContextualMenu= "启用";
kmDisableContextualMenu= "关闭";
kmEnableNContextualMenu= "启用%d动作";
kmDisableNContextualMenu= "禁用%d动作";

ACProcessControl= "应用控制";
ACInterfaceControl= "接口控制";
ACiTunesControl= "iTunes的控制";
ACQuickTimePlayerControl= "QuickTime播放器控制";
ACMailControl= "邮件控制";
ACWebBrowserControl= "%@控制";
ACSystemControl= "系统控制";
ACMIDI= "MIDI";
ACOpen= "打开";
ACExecute= "执行";
ACWeb= "Web";
ACFile= "文件";
ACImage= "图片";
ACText= "文本";
ACClipboard= "剪贴板";
ACVariables= "变量";
ACActivateSwitcher= "切换器";
ACNotifications= "通知";
ACControlFlow= "控制流";
ACKeyboardMaestro= "键盘大师";
ACDebugger= "调试器";
ACPlugIns= "第三方插件插件";

ACClipboardCut= "剪切";
ACClipboardCopy= "复制";
ACClipboardPaste= "粘贴";

ACClipboardToVariable= "设置剪贴板变量";
ACVariableToClipboard= "设置变量到剪贴板";
ACSetKeychainPasswordToVariable= "设置钥匙串密码到变量";

ACDeleteCurrentClipboard= "删除当前剪贴板";

csBrowserHelpFlavorTypesPrefix= "剪贴板中的内容类型：";
csBrowserHelpTextPreviewPrefix= "文本预览：\r\r";

csCopyActionMessage= "复制到剪贴板命名为：";
csCutActionMessage= "剪切到指定的剪贴板";
csPasteActionMessage= "从命名剪贴板粘贴";

csHistoryActionMessage= "从剪贴板粘贴的历史";
NonTextClipboardMD5Format= "非文本剪贴板%@";

csInsertNewClipDataItem= "<创建新的命名剪贴板>";
csNewClipboardTitleFormat= "Clipboard #%d";
csNewClipboardDefaultData= "默认剪贴板文本";
DefaultClipboardName= "默认剪贴板";

csNoClipboardsAvailable= "没有可用的剪贴板";

ClipboardHistorySwitcherPasteWindowTitle= "剪贴板历史录制切换器";
ClipboardNamedSwitcherCutWindowTitle= "命名的剪贴板切换器 - 剪切";
ClipboardNamedSwitcherCopyWindowTitle= "命名的剪贴板切换器 - 复制";
ClipboardNamedSwitcherPasteWindowTitle= "剪贴板切换器 - 粘贴";

ReceivedClipboard= "接到剪贴板";
SentClipboard= "已发送剪贴板";
SentClipboardAbandonded= "剪贴板发送失败（太多重试）";

PreferencesWindowTitle= "首选项：%@";
IconChooserWindowTitle= "图标选配：%@";

NoClipboardText= "剪贴板中没有文字";

wsWindowSwitchNoWindowsString= "没有Windows可用";
wsWindowSwitchNoAXAString= "无障碍禁用";

psProgramSwitchNoProgramsString= "没有可用的应用程序";

kmKeystrokeBadErrorStr= "击键不能使用。";
kmKeystrokeBadAlreadyUsedStr= "在您按下与宏‘%@’热键这个热键冲突的击键。";

ManualSIVCNoNewVersionTitle= "键盘大师是最新的。";
ManualSIVCNoNewVersionStr= "您运行的是最新版本。";

ManualSIVCErrorTitle= "版本检查失败。";
ManualSIVCErrorStr= "试图检查键盘大师的当前版本时发生错误。";

SIVCTitle= "键盘大师更新";
SIVCHeading= "键盘大师的新版本。";
SIVCDescription= "键盘大师%@现已（你有%@）。是否要立即下载并安装吗？";

InstallFailedTitle= "自动安装失败。";
InstallFailedStr= "试图安装装配键盘大师更新，重定向到下载页面发生错误。";

MacroGroupAvailableHTML_All= "可在所有应用程序。";
MacroGroupAvailableHTML_Active= "可在这些应用程序：";
MacroGroupAvailableHTML_NotActive= "可用的<strong>除了</ STRONG>在这些应用中：";
MacroGroupAvailableHTML_Running= "这些应用程序时可用的<strong>任何</ STRONG>运行";
MacroGroupAvailableHTML_RunningNotActive= "不用时这些应用程序中的任但至少有一个正在运行推介：";
MacroGroupAvailableHTML_NotRunning= "当可用的<strong>没有这些应用程序的</ STRONG>运行";

MacroGroupActivationNormal= "始终处于激活状态。";
MacroGroupActivationOnceAfterTrigger= "激活一个动作时";
MacroGroupActivationToggleWithTrigger= "激活/停用时";
MacroGroupActivationOnceWithPalette= "显示了一个动作一个悬浮菜单时：";
MacroGroupActivationWithPalette= "显示/隐藏悬浮菜单时：";
MacroGroupActivationAlwaysWithPalette= "显示悬浮菜单，直到";
MacroGroupActivationNormalUnderMouse= "始终处于激活状态。";
MacroGroupActivationOnceAfterTriggerUnderMouse= "激活一个动作时";
MacroGroupActivationToggleWithTriggerUnderMouse= "激活/停用时";
MacroGroupActivationOnceWithPaletteUnderMouse= "显示一个作用下鼠标悬浮菜单时：";
MacroGroupActivationWithPaletteUnderMouse= "显示/隐藏鼠标下一个悬浮菜单时：";
MacroGroupActivationAlwaysWithPaletteUnderMouse= "显示鼠标下的悬浮菜单，直到";

MacroGroupFrontWindowCondition_Always= "可在所有窗口。";
MacroGroupFrontWindowCondition_Exists= "当有一个聚焦窗口可用。";
MacroGroupFrontWindowCondition_DoesNotExist= "当没有聚焦窗口可用。";
MacroGroupFrontWindowCondition_TitleIs= "当可用的集中聚焦的窗口是“%@”。";
MacroGroupFrontWindowCondition_TitleIsNot= "当可用的聚焦聚焦窗口不是“%@”。";
MacroGroupFrontWindowCondition_ExistsButTitleIsNot= "当有聚焦的窗口，但它的标题不是“%@”可用。";
MacroGroupFrontWindowCondition_TitleContains= "可用时，聚焦窗口标题包含“%@”。";
MacroGroupFrontWindowCondition_TitleDoesNotContain= "可用时，聚焦窗口标题不包含“%@”。";
MacroGroupFrontWindowCondition_ExistsButTitleDoesNotContain= "当有聚焦窗口，但其名称不包含“%@”可用。";
MacroGroupFrontWindowCondition_TitleMatches= "可用时，聚焦窗口标题匹配“%@”。";
MacroGroupFrontWindowCondition_TitleDoesNotMatch= "可用时，聚焦窗口的标题不匹配“%@”。";
MacroGroupFrontWindowCondition_ExistsButTitleDoesNotMatch= "当有聚焦窗口，但它的标题不匹配“%@”可用。";

smiSubMenuItemTitleFormat= "子菜单%d：";

csDeleteClipDataWarningStr= "你确定要删除所选的剪贴板位置（S）？";

smProgramSwitcherMacroName= "应用程序切换";
smWindowSwitcherMacroName= "窗口切换器";
smApplicationLauncherMacroName= "应用程序启动";

AskPermissionStr                        = "键盘大师引擎所需的宏功能";
AskPermissionText                       = "键盘大师将推出键盘大师引擎这是实际执行的宏和它应该继续运行在退出键盘大师后，使您的宏继续运行。You当您更改宏只需要键盘大师编辑器。You可以通过选择键盘大师状态菜单中选择退出键盘大师引擎在任何时候退出引擎。你也应该能够在登录的喜好启动引擎使引擎将始终可用。What应该发生的引擎时，您退出键盘大师编辑吗？";
AskPermissionKeepRunningButton          = "继续运行";
AskPermissionAlwaysKeepRunningButton    = "始终保持运行";
AskPermissionQuitButton= "放弃";

WarnAccessibilityTitle= "辅助功能需要访问";
WarnAccessibilityMessage= "无障碍访问控制你的计算机需要使用许多功能，包括选择菜单项，动作窗口，按下按钮，输入字符串触发器和窗口切换。请启用对安全和隐私的系统偏好设置面板中的隐私部分的辅助部分键盘大师和键盘大师引擎辅助功能。";
WarnAccessibilityDefaultButton= "打开首";
WarnAccessibilityIgnoreButton= "后来";
WarnAccessibilityHelpButton= "帮助";
WarnAccessibilityNotAgainButton= "不要再询问";

UniversalAccessWarningTitle= "辅助功能需要访问";
UniversalAccessWarningMessage= "无障碍访问控制你的计算机需要使用很多功能选择菜单项，动作窗口，按下按钮，输入字符串触发器和窗口切换。请启用无障碍的隐私的辅助部分键盘大师和键盘大师引擎在安全和隐私的系统偏好设置面板的部分。";
UniversalAccessWarningDefaultButton= "打开系统偏好设置";
UniversalAccessWarningIgnoreButton= "后来";

WarnKMSwitcherConflictStr= "键盘大师已启用切换器";
WarnKMSwitcherConflictText= "键盘大师引擎正在运行，并且启用了其自身的切换。这些可以通过切换大师提供的切换冲突，所以你可能要禁用它们。";
WarnKMSwitcherConflictDefaultButton= "启动键盘大师";
WarnKMSwitcherConflictIgnoreButton= "也许以后";
WarnKMSwitcherConflictNotAgainButton= "不要再询问";

WarnPrefWriteFailedStr= "偏好写入失败";
WarnPrefWriteFailedText= "键盘大师未能写入首选项文件。%@%@您应该退出并解决问题，然后重新启动键盘大师。";
WarnPrefWriteFailedDefaultButton= "放弃";
WarnPrefWriteFailedContineButton= "仍然继续";
WarnPrefWriteFailedHelpButton= "帮助";

SharingDisabledBecauseOfNewerWarningTitle= "宏禁用同步功能";
SharingDisabledBecauseOfNewerWarningMessage= "同步宏已被禁用，因为宏同步文件来自键盘大师的新版本。更新此版本的键盘大师的恢复共享，否则当你更新你的本地修改将被销毁。";
SharingDisabledBecauseOfNewerDefaultButton= "检查更新";
SharingDisabledBecauseOfNewerStopButton= "停止同步";
SharingDisabledBecauseOfNewerIgnoreButton= "危险地生活";

SecureInputWarningTitle= "安全输入被启用";
SecureInputWarningMessage= "安全输入使能，这意味着该系统认为你是目前在密码字段，并且不允许应用程序来监视键盘。This将停止输入字符串的工作，以及来自检测击键停止键盘大师触发，同时设置热键。You需要找到负责应用程序（通常的1Password或LastPass的或自己的Chrome扩展）并退出它。";
SecureInputDefaultButton= "好";
SecureInputHelpButton= "帮助";

Early1010WarningTitle= "优山美地的早期版本";
Early1010WarningMessage= "您正在运行OS X 10.10优胜美地的早期版本。之前10.10.3优山美地的版本在辅助功能首选项设置系统严重错误，使得它很难启用辅助功能为键盘大师，尤其是键盘大师引擎。强烈建议您升级到10.10.3或更高版本，如果在所有可能的。";
Early1010DefaultButton= "好";
Early1010HelpButton= "帮助";

NamedClipboardDeleteWarningTitle= "在使用名为剪贴板";
NamedClipboardDeleteWarningMessage= "一个或多个命名剪贴板您要删除目前正在由宏使用。您可以删除它，但它很快就会被重新创建。";
NamedClipboardDeleteDefaultButton= "删除";
NamedClipboardDeleteCancelButton= "取消";

VariableDeleteWarningTitle= "变量使用";
VariableDeleteWarningMessage= "一个或多个您要删除的变量目前正处于由宏使用。您可以删除它，但它可能很快被重新创建。";
VariableDeleteDefaultButton= "删除";
VariableDeleteCancelButton= "取消";

SharingOpenWarningTitle= "这将替换您所有的宏";
SharingOpenWarningMessage= "从现有的宏文件同步同步将与您选择的远程文件中的宏替换所有现有的宏。";
SharingOpenDefaultButton= "全部替换宏";
SharingOpenCancelButton= "取消";

ApplicationSwitcherPreferencePanelLabel= "应用程序切换";
WindowSwitcherPreferencePanelLabel= "窗口切换器";
ApplicationLauncherPreferencePanelLabel= "应用程序启动";

hkDefaultMacroGroupName= "全局宏组";
hkOldDefaultMacroGroupName= "全局宏设置";
hkSwitcherGroupName= "切换组";
menuQuitEngineItemTitle= "退出引擎";
menuLaunchEngineItemTitle= "启动引擎";

menuPurchaseUpgradeTitle= "购买键盘大师升级...";
menuPurchaseTitle= "购买键盘大师...";

ExportMacrosDefaultFileName= "无题宏文件";
ExportMacrosSaveTitle= "导出宏";

ExportActionsDefaultFileName= "键盘大师动作";
ExportActionsSaveTitle= "导出动作";

SyncMacrosDefaultFileName= "键盘大师宏";
SyncMacrosSaveTitle= "保存文件同步";

SyncMacrosFailedHeader= "无法启动同步宏。";
SyncMacrosFailedMessage= "启动同步宏的调试失败（%@）。";

SyncCreateMacrosSuccessTitle= "宏正在同步启动";
SyncCreateMacrosSuccessMessage= "宏已被写入到同步文件，并且每当当地宏改变将被写入。要同步的文件所做的任何更改将导致从该文件被替换的本地宏。";

SyncOpenMacrosSuccessTitle= "宏正在同步启动";
SyncOpenMacrosSuccessMessage= "宏已被替换为来自同步文件，并随时根据当地的宏改变了宏将被写入。要同步的文件所做的任何更改将导致从该文件被替换的本地宏。";

ShareLibraryDefaultFileName= "无题库文件";
ShareLibrarySaveTitle= "共享库";

ShareLibrary_Success_Title= "保存的共享库";
ShareLibrary_Success_Description0= "写入文件，但没有宏被保存。";
ShareLibrary_Success_Description1= "一个宏被保存到库中。";
ShareLibrary_Success_Description2= "%d宏被保存到库中。";

LibraryAllEntries= "所有条目";

ShareActionsOrMacrosFailedHeader= "无法导出%@。";
ShareActionsOrMacrosFailedMessage= "导出%@的调试失败，则%@尚未导出。";

ExportMacrosFailedHeader= "无法导出宏。";
ExportMacrosFailedMessage= "导出宏的调试失败，宏尚未导出。";

ExportMacros_Success_Title= "导出宏";
ExportMacros_Success_Description0= "写入文件，但没有宏导出。";
ExportMacros_Success_Description1= "一个宏导出。";
ExportMacros_Success_Description2= "%d宏导出。";

ExportActionsFailedHeader= "无法导出动作。";
ExportActionsFailedMessage= "导出动作的调试失败，动作尚未导出。";

ExportActions_Success_Title= "导出动作";
ExportActions_Success_Description0= "写入文件，但没有动作导出。";
ExportActions_Success_Description1= "一个动作导出。";
ExportActions_Success_Description2= "%d动作被导出。";

ImportActions_Success_Title= "导入动作";
ImportActions_Success_Description0= "写入文件，但没有动作被导入。";
ImportActions_Success_Description1= "一个动作importeded。";
ImportActions_Success_Description2= "%d动作被importeded。";

ImportActions_CantImportErrorTitle= "不能导入动作文件";
ImportActions_CantImportError_UnknownExplanation= "您选择的是一个未知格式的文件动作。";

ImportMacros_CantImportErrorTitle= "不能导入宏文件";
ImportMacros_CantImportError_UnknownExplanation= "您选择的宏文件是一个未知的格式。";

ImportMacros_Success_Title= "导入宏";

ImportLibrary_CantImportErrorTitle= "不能导入库文件";
ImportLibrary_CantImportError_UnknownExplanation= "您选择的库文件是未知格式。";

ImportLibrary_Success_Title= "库已插入";
Import_Success_Description000= "该文件已被读取，但没有宏导入。";
Import_Success_Description001= "一个智能组导入。";
Import_Success_Description002= "%%d个智能组导入。";
Import_Success_Description110= "一个宏导入。";
Import_Success_Description111= "一个宏和一个智能组导入。";
Import_Success_Description112= "一个宏和%%d智能组是导入的。";
Import_Success_Description210= "%d宏被导入到一个宏组。";
Import_Success_Description211= "%d宏导入到一个宏组和一个智能组导入。";
Import_Success_Description212= "%d宏导入到一个宏组和%%d智能组是导入的。";
Import_Success_Description220= "%d宏导入到%d宏组。";
Import_Success_Description221= "%d宏导入到%d宏组和一个智能组导入。";
Import_Success_Description222= "%d宏导入到%d宏组和%%d智能组是导入的。";

MacroGroupDefaultName_GlobalTarget= "宏用于所有应用程序";
MacroGroupDefaultName_SpecificApps= "宏用于";
MacroGroupDefaultName_ExcludedApps= "宏未启用于";
MacroGroupDefaultName_AppSeperator= "，";

NagWindowTitle= "键盘大师%@";
NagWindowQuit= "放弃";
NagWindowTrial= "继续试用";
NagWindowQuitDescription= "您的试用期已经结束。";
NagWindowTrialDescription= "您的试用期即将结束。";

DownloadURL= "http://download.keyboardmaestro.com/";
PurchaseURL= "http://purchase.keyboardmaestro.com/";
LostSerialURL= "http://enquiry.stairways.com/";
LostSerialURLFormat= "http://enquiry.stairways.com/?email=%@";

InvalidSerialHeader= "You have entered an invalid email address or an invalid serial number.";
InvalidSerialMessage= "Make sure you enter your email address and serial number exactly as they appear on your registration acknowledgment email.";

OldSerialHeader= "You have entered an old serial number.";
OldSerialMessage= "The username and serial number you have entered is valid for an older version, you will need to enter your new serial number.";

PurchaseUpgradeURL= "http://upgrade.keyboardmaestro.com/?serial=%@";

DownloadURL= "http://download.keyboardmaestro.com/";
PurchaseURL= "http://purchase.keyboardmaestro.com/";
LostSerialURL= "http://enquiry.stairways.com/";
LostSerialURLFormat= "http://enquiry.stairways.com/?email=%@";

InvalidSerialHeader= "您输入的电子邮件地址无效或无效的序列号。";
InvalidSerialMessage= "请确保您输入您的电子邮件地址和序列号，正是因为他们出现在您的登记确认的电子邮件。";

OldSerialHeader= "您输入的旧序列号。";
OldSerialMessage= "您所输入的用户名和序列号的有效期为一个旧版本，你需要输入你的新的序列号。";

PurchaseUpgradeURL= "http://upgrade.keyboardmaestro.com/?serial=%@";

PSShowMenu= "显示（S）";
PSHideMenu= "隐藏（H）";

PSLaunchMenu= "启动（L）";
PSLaunchAndHideOthersMenu= "启动和隐藏其他（四）";

PSSwitchMenu= "激活（L）";
PSSwitchAndHideOthersMenu= "激活和隐藏其他（四）";

ALLaunchMenu= "启动";
ALLaunchAndHideOthersMenu= "启动和隐藏其他";

ALSwitchMenu= "启用";
ALSwitchAndHideOthersMenu= "激活和隐藏其他";

SIVCLanguage= "EN";

AboutRegisteredTo= "The Shark破解;墨问非名汉化20160502v0.7";
AboutTrialVersion= "试用版";
MacAppStoreVersion= "Mac App Store的版本";

apmNoApplicationSelected= "任何应用程序中选择";
apmMore= "更多…";
apmOther= "其他…";

DefaultSearchTitle= "用谷歌搜索网页";
DefaultSearchURL= "http://www.google.com/search?q=%Search%";

hkSwitchToLastApplication= "激活上一个应用程序";
hkSwitchToNextApplication= "激活下一个应用程序";
hkBringWindowsForward= "把应用程序窗口设为前台";
hkSearch= "搜索网页";
hkTriggerByName= "通过名称触发宏";
hkOpen1File= "打开一个文件，文件夹或应用程序";
hkFile= "将文件移动，复制或移到回收站";
hkReadFile= "读取文件";
hkWriteFile= "写入文件或附加到文件结尾";
hkWriteFileWrite= "写入文件";
hkWriteFileAppend= "附加到文件结尾";
hkNewFolder= "新建文件夹";
hkPlugIn= "插入";
hkGetFileAttribute= "获取文件属性";
hkSetFileAttribute= "设置文件属性";
hkOpenFinderSelection= "打开Finder中选中文件";
hkOpenURL= "打开网址";
hkActivateApplication= "激活特定应用";
hkQuitOthers= "退出其他应用程序";
hkQuitAll= "退出所有应用程序";
hkQuitSpecificApp= "退出特定应用程序";
hkQuitCurrentApp= "退出前台应用程序";
hkHideOthers= "隐藏其他应用程序";
hkHideAll= "隐藏所有应用程序";
hkHideCurrent= "隐藏前台应用程序";
hkHideSpecificApp= "隐藏特定的应用";
hkShowAll= "显示所有的应用程序";
hkShowSpecificApp= "显示特定应用程序";
hkInsertText= "插入文本";
hkSetFindPasteboard= "设置查找纸板";
hkSetNetworkLocation= "设置网络位置";
hkFastUserSwitch= "快速用户切换";
hkSetKeyboardLayout= "设置键盘布局";
hkQuickMacro= "快速录制宏";
hkSimulateKeystroke= "键入按键";
hkSimulateModifiers= "键入修饰键";
hkSimulateHardwareKey= "模拟硬件密钥";
hkExecuteAppleScript= "执行一个AppleScript";
hkExecuteJavaScript= "在Safari中执行一个JavaScript";
hkExecuteShellScript= "执行一个Shell脚本";
hkExecuteJavaScriptForAutomation= "执行一个JavaScript自动化脚本";
hkExecuteJavaScriptForCustomPrompt		= "Execute a JavaScript in Custom Prompt";
hkExecuteJavaScriptForCustomPromptAll	= "Execute a JavaScript in all Custom Prompts";
hkExecuteJavaScriptForCustomPromptTitle	= "Execute a JavaScript in Custom Prompt with ID ‘%@’";
hkExecuteSwift= "执行一个Swift脚本";
hkExecuteWorkflow= "执行一个Automator工作流";
hkExecuteMacro= "执行宏";
hkMarkMacro= "标记宏";
hkSetMacroEnable= "设定宏或组启用";
hkSystemPrefPane= "打开系统偏好设置面板";
hkOpen1Password= "打开1Password收藏";
hkMouseMoveAndClick= "移动或点击鼠标";
hkSpeakText= "朗读文本";
hkPlaySound= "播放声音";
hkSystemAction= "执行系统动作";
hkDebuggerAction= "调试器动作";
hkSystemVolume= "设置系统输出音量";
hkSendMIDIMessage= "发送MIDI信息";
hkPause= "暂停";
hkPauseUntil= "暂停，直到";
hkWhile= "而";
hkUntil= "直到";
hkRepeat= "重复";
hkGroup= "组";
hkIfThenElse= "如果然后否则";
hkSwitch= "切换/情形";
hkFor= "对于每个";
hkAlert= "警告";
hkComment= "评论";
hkCancel= "取消宏";
hkMacroGroupToggle= "切换宏组";
hkConcealMacroPalettes= "隐瞒宏悬浮菜单";
hkSelectMenuItem= "选择或显示一个菜单项";
hkiTunesControl= "iTunes控制";
hkQuickTimePlayerControl= "QuickTime播放器控制";
hkScrollWheelEvent= "模拟滚轮";
hkManipulateWindow= "动作窗口";
hkHiliteLocation= "突出位置";
hkScreenCapture= "屏幕捕捉";
hkFindImage= "发现屏幕上的图像";
hkTransformImage= "变换图像";
hkCompositeImage= "复合到图像上";
hkDrawImage= "画到图像上";
hkResizeImage= "调整图像";
hkGetImageSize= "获取图像尺寸";
hkTrimImage= "裁剪图像";
hkDisplayImage= "显示剪贴板";
hkNewImage= "建立新的图像";
hkPressButtonItem= "按下一个按钮";
hkSemaphore= "信号";
hkClipboardSwitcher= "使用已命名剪贴板";
hkCutCopyPaste= "剪切拷贝粘贴";
hkSetClipboardToText= "将剪贴板设置到文本";
hkSetClipboardToPastClipboard= "设置剪贴板过去剪贴板";
hkSetClipboardToNamedClipboard= "设置剪贴板命名剪贴板";// depricat
hkSaveClipboardToNamedClipboard= "保存到剪贴板剪贴板命名";// depricat
hkCopyClipboard= "剪贴板复制到剪贴板";
hkDeletePastClipboard= "删除过去的剪贴板";
hkFilterClipboard= "过滤剪贴板";
hkSearchReplaceClipboard= "搜索和替换剪贴板";
hkApplyStyle= "应用样式复制到剪贴板";
hkApplyTextFactory= "应用的BBEdit文本厂";
hkSetVariableToText= "变量设置文本";
hkSetVariableToKeychainPassword= "变量设置的钥匙串密码";
hkSetKeychainPasswordToText= "将钥匙串密码为文本";
hkSetVariableToSafariField= "设置变量到Safari域";
hkSafariControl= "Safari浏览器控制";
hkSetSafariFieldToText= "设置Safari浏览器字段设置为text";
hkSetSafariCheckbox= "Safari浏览器设置复选框";
hkSetSafariRadio= "Safari浏览器设置电台";
hkSetMailStatus= "设置邮件状态";
hkMailSendMessage= "发送邮件";
hkSetVariableToCalculation= "设置变量为算式";
hkSetActionDelay= "设置动作延迟";
hkSearchReplaceVariable= "搜索和替换变量";
hkSearchVariable= "搜索变量";
hkSearchClipboard= "搜索剪贴板";
hkSubstring= "变或剪贴板子";
hkUseVariable= "采用变量";
hkFilterVariable= "筛选变量";
hkPromptForUserInput= "提示用户输入";
hkCustomPrompt= "自定义HTML提示";

hkProgramSwitcher= "激活应用程序切换";
hkSMApplicationSwitcher= "激活应用程序切换";
hkWindowSwitcher= "激活窗口切换器";
hkApplicationLauncher= "启动应用程序启动器";
hkClipboardSwitcherCopy= "激活剪贴板复制切换器";
hkClipboardSwitcherCut= "激活剪贴板剪切切换器";
hkClipboardSwitcherPaste= "激活剪贴板粘贴切换器";
hkClipboardHistorySwitcher= "激活剪贴板历史记录切换器";

hkGrowl= "Growl通知";
hkLog= "日志";
hkNotification= "通知";

SelectMenuApplicationNotFound= "选择菜单项未能找到%@目标应用程序。";
SelectMenuApplicationNotFoundApp= "选择菜单项未能找到目标应用为‘%@’%%@。";
SelectMenuBarNotFound= "选择菜单项未能找到目标菜单栏%@。";
SelectMenuItemNotFound= "选择菜单项未能找到目标菜单项%@。";
SelectMenuItemDisabled= "选择菜单项目失败，因为该菜单项%@被禁用。";
SelectMenuItemFailed= "菜单选择没有挑菜单%@错误%ld个。";
SelectMenuItemRequiresAccess= "选择菜单动作需要被禁用的辅助功能。";

PressButtonWindowNotFound= "按下按钮‘%@’未能找到窗口。";
PressButtonButtonNotFound= "按下按钮‘%@’未能找到按钮。";
PressButtonDisabled= "因为按钮被禁用按下按钮‘%@’失败。";
PressButtonRequiresAccess= "按下按钮动作需要被禁用的辅助功能。";

MouseClickNoFrontWindow= "移动或点击鼠标没有发现前台窗口。";
MouseClickNoImageFound= "移动或点击鼠标没有发现独一图像。";
MouseClickNoImage= "移动或点击鼠标没有指定的图像。";
MouseClickCalculateFailed= "移动或点击鼠标的计算%@失败。";

TimeoutExceeded= "动作超时。";

MacroCancelledFormat= "%@宏‘%@’取消（在执行%@）。";

ActionFailedFormat= "%@在宏‘%@’（在执行%@）。";

CancelAllMacros= "取消所有宏";
CancelAllOtherMacros= "取消所有其他宏";
CancelThisMacro= "取消此宏";
CancelJustThisMacro= "只取消这个宏";
BreakFromLoop= "打破循环";

ConcealActionTitle= "隐瞒宏悬浮菜单";
RevealActionTitle= "显示宏悬浮菜单";
ToggleActionTitle= "隐藏/显示宏悬浮菜单";
ConcealUntilAppSwitchActionTitle= "隐瞒宏悬浮菜单直到切换";
ConcealUntilAppSwitchOrRevealActionTitle= "隐藏/显示宏悬浮菜单直到切换";

kmModifierKeySeparator= "";
kmModifierKeySuffix= "";
kmFKeyFormat= "F%d";

kmModifierKeyLongSeparator= ",";
kmModifierControl= "Control";
kmModifierOption= "Option";
kmModifierShift= "Shift";
kmModifierCommand= "Command";

kmActivateApplicationTitleFormat= "激活%@";

kmHiliteLocationTitleRectangle= "在%@突出矩形，%@，%@，%@";
kmHiliteLocationTitleOval= "在%@选中椭圆形，%@，%@，%@";
kmHiliteLocationTitleTarget= "在%@突出目标，%@，%@，%@";

kmExecuteAppleScriptType= "AppleScript";
kmExecuteJavaScriptType= "在JavaScript的%@";
kmExecuteShellScriptType= "Shell脚本";
kmExecuteJavaScriptForAutomationType= "JavaScript的自动化";
kmExecuteSwiftScriptType= "Swift脚本";

kmExecuteBaseScriptTitleFormat= "执行‘%@’%@";
kmExecuteBaseScriptTitle= "执行%@";

kmCustomPromptTitleFormat= "自定义HTML提示‘%@’";
kmCustomPromptTitle= "自定义HTML提示";

kmFindImageHTML= "查找%@图像在屏幕上变‘%@’";

kmExecuteBaseScriptResultsTitle= "%@结果";
//kmExecuteBaseScriptFileFormatResultsDescription= "The output of script ‘%@’ is:";
//kmExecuteBaseScriptTextScriptResultsDescription= "The output of the text script is:";
kmExecuteRootScriptResultsDescription= "%@的输出为：";

kmExecuteBaseScriptFileFormatLongName= "脚本‘%@’";
kmExecuteBaseScriptTextLongName= "文字脚本";


ExecuteBaseScriptResultWindow= "在一个窗口中显示%@。";
ExecuteBaseScriptResultBriefly= "显示%@简单。";
ExecuteBaseScriptResultLarge= "显示%@大。";
ExecuteBaseScriptResultTyping= "键入%@。";
ExecuteBaseScriptResultPasting= "粘贴%@。";
ExecuteBaseScriptResultVariable= "保存%@变量'%%@“。";
ExecuteBaseScriptResultClipboard= "保存到%@%%@。";
ExecuteBaseScriptResultAsynchronously= "异步执行。";

ExecuteBaseScriptResultTrim0StdErr0= "结果没有错误";
ExecuteBaseScriptResultTrim0StdErr1= "结果";
ExecuteBaseScriptResultTrim1StdErr0= "修剪结果没有错误";
ExecuteBaseScriptResultTrim1StdErr1= "修剪结果";

kmPlugInLongScriptName= "插上动作‘%@’";

kmExecuteWorkflowTitleFormat= "执行‘%@’的Automator工作流";

kmExecuteMacroTitleFormat= "执行宏‘%@’";
kmExecuteMacroAsynchronouslyTitleFormat= "执行宏‘%@’异步";

kmMarkMacroMarkTitleFormat= "标记宏‘%@’";
kmMarkMacroUnmarkTitleFormat= "取消标记宏‘%@’";
kmMarkMacroToggleTitleFormat= "切换标记宏‘%@’";

kmMarkUnknownMacroMarkTitleFormat= "标记宏";
kmMarkUnknownMacroUnmarkTitleFormat= "取消标记宏";
kmMarkUnknownMacroToggleTitleFormat= "切换标记宏";

NoMacroSelectionName= "无";

kMacroGroupToggleInternalAutomatic= "内部切换宏组";
kMacroGroupToggleOnce= "激活宏组一个动作";
kMacroGroupToggleActivate= "激活宏组";
kMacroGroupToggleDeactivate= "停用宏组";
kMacroGroupToggleToggle= "激活/停用宏组";
kMacroGroupToggleOnceWithPalette= "显示宏组一个动作";
kMacroGroupToggleShowPalette= "显示宏组";
kMacroGroupToggleHidePalette= "隐藏宏组";
kMacroGroupToggleTogglePalette= "显示/隐藏宏组";

kMacroGroupToggleInternalAutomaticFormat= "内部切换宏组‘%@’";
kMacroGroupToggleOnceFormat= "激活宏组‘%@’的一个动作";
kMacroGroupToggleActivateFormat= "激活宏组‘%@’";
kMacroGroupToggleDeactivateFormat= "停用宏组‘%@’";
kMacroGroupToggleToggleFormat= "激活/停用宏组‘%@’";
kMacroGroupToggleOnceWithPaletteFormat= "显示宏组‘%@’的一个动作";
kMacroGroupToggleShowPaletteFormat= "显示宏组‘%@’";
kMacroGroupToggleHidePaletteFormat= "隐藏宏组‘%@’";
kMacroGroupToggleTogglePaletteFormat= "显示/隐藏宏组‘%@’";

kSetMacroEnableEnableTitleFormat= "启用%@";
kSetMacroEnableDisableTitleFormat= "禁用%@";
kSetMacroEnableToggleTitleFormat= "切换%@启用";
kSetMacroEnableNoMacro= "未知";

kmMacroUnknownUnambiguousName= "宏/宏组无";
kmMacroUnambiguousName= "宏‘%@’";
kmMacroGroupUnambiguousName= "宏组‘%@’";
kmMacroSmartGroupUnambiguousName= "智能组别‘%@’";

kmApplyTextFactoryTitleFormat= "应用文本厂‘%@’";

kmFileRevealOperation= "显示";
kmFileMoveOperation= "移动或重命名";
kmFileCopyOperation= "拷贝";
kmFileDuplicateOperation= "复制";
kmFileTrashOperation= "移到废纸篓";
kmFileDeleteOperation= "删除";
kmFileRecursiveDeleteOperation= "递归删除";

kmFileTitleFormat= "%@文件";
kmFileTitleLongFormat= "%@文件‘%@’";

kmReadFileToClipboardTitleFormat= "读文件到剪贴板";
kmReadFileToNamedClipboardTitleFormat= "读文件到剪贴板命名‘%@’";
kmReadFileToVariableTitleFormat= "读文件到变量‘%@’";

kmWriteOperationNormal= "写";
kmWriteOperationAppend= "附加";

kmWriteFileFromClipboardTitleFormat= "%@剪贴板";
kmWriteFileFromNamedClipboardTitleFormat= "%@命名剪贴板‘%@’";
kmWriteFileFromVariableTitleFormat= "%@变量‘%@’";
kmWriteFileFromPlainTextTitleFormat= "%@文本";
kmWriteFileFromStyledTextTitleFormat= "%@样式文本";

kmWriteFileMakeLongTitleFormat= "%@到文件";

kmActionTextSourceClipboard= "%@剪贴板";
kmActionTextSourceNamedClipboardFormat= "%@命名剪贴板‘%@’";
kmActionTextSourceVariableFormat= "%@变量‘%@’的";
kmActionTextSourceTextFormat= "%@文本‘%@’";

kmSubstringActionName= "获取子串";
kmSwitchActionName= "切换";

kmSubstringDestinationHTMLClipboard= "结果保存到剪贴板";
kmSubstringDestinationHTMLNamedClipboardFormat= "结果存入剪贴板命名‘%@’";
kmSubstringDestinationHTMLVariableFormat= "结果存入变量‘%@’";

kmCompositeImageClipboard= "复合剪贴板上的图像";
kmCompositeImageText= "复合文字到图片";

kmCompositeImageHTMLClipboard= "复合%@到图像中%@";
kmCompositeImageHTMLText= "复合文字到图片中%@";

kmNewFolderTitleLongFormat= "创建新文件夹‘%@’";

kClipboardTargetClipboard= "剪贴板";
kClipboardTargetNamedClipboardFormat= "命名剪贴板‘%@’";

kmApplyStyleHTMLDescriptionTitleFormat= "应用样式%@";
kmApplyTextFactoryHTMLDescriptionTitleFormat= "应用文本工厂以%@";


kApplyStyleToTo= "应用最多字符%@";
kApplyStyleToFrom= "从性格应用%@";
kApplyStyleToLast= "适用于持续%@字符";
kApplyStyleToRange= "从字符长度%@应用%@";
kApplyStyleToFromTo= "从性格%@适用于字符%@";


kSubstringRangeTo= "子范围可达字符%@";
kSubstringRangeFrom= "从性格子范围%@";
kSubstringRangeLast= "最后%@字符子范围";
kSubstringRangeRange= "从子范围字符长度%@%@";
kSubstringRangeFromTo= "从性格%@字符子范围%@";


kSubstringRangeDeleteTo= "子范围中删除了字符%@";
kSubstringRangeDeleteFrom= "从子范围删除字符%@";
kSubstringRangeDeleteLast= "子界删除最后一个字符%@";
kSubstringRangeDeleteRange= "从子范围字符长度%@删除%@";
kSubstringRangeDeleteFromTo= "从子范围字符%@删除字符%@";

hkTrimImageHTMLTitle= "裁剪图像在%@";

kmNewImageHTMLDescriptionTitleFormat= "创建新形象%@";

kmDisplayImageFormat= "显示%@";
kmSetNetworkLocationFormat= "设置网络位置‘%@’";

kFileAttributeFileType= "文件类型";
kFileAttributeFileSize= "文件大小";
kFileAttributeCreationDate= "创建日期";
kFileAttributeModificationDate= "日期修饰键";
kFileAttributeOwnerName= "业主名称";
kFileAttributeOwnerID= "所有者ID";
kFileAttributeGroupName= "组名称";
kFileAttributeGroupID= "组ID";
kFileAttributePosixPermissions= "POSIX权限";
kFileAttributeExtensionHidden= "扩展隐藏";
kFileAttributeHFSCreatorCode= "HFS创建者代码";
kFileAttributeHFSTypeCode= "HFS类型代码";
kFileAttributeTags= "标签";
kFileAttributeTagsAdd= "标签（添加）";
kFileAttributeTagsToggle= "标签（切换）";
kFileAttributeTagsRemove= "标签（删除）";
kFileAttributeParent= "亲";
kFileAttributeName= "文件名";
kFileAttributeBaseName= "基本名称";
kFileAttributeExtension= "延期";
kFileAttributeContentType= "内容类型";
kFileAttributeContentKind= "内容种类";
kFileAttributeInvisible= "无形";
kFileAttributeAddedDate= "添加日期";
kFileAttributeDownloadedDate= "下载日期";
kFileAttributeLastUsedDate= "日期上次使用";
kFileAttributeWhereFrom= "从哪里";
kFileAttributeComment= "评论";

kmGetFileAttributeTitleFormat= "获取%@到变量‘%@’";
kmSetFileAttributeTitleFormat= "设置为%@‘%@’";

kmOpen1FileTitleFormat= "打开‘%@’";
kmOpenPrefPaneTitleFormat= "打开%@偏好窗格";

kmOpen1PasswordTitleFormat= "打开的1Password收藏%@“";

kmSimulateKeystrokePressAndReleaseTitleFormat= "键入%@按键";
kmSimulateKeystrokePressAndHoldTitleFormat= "长按按键%@";
kmSimulateKeystrokePressAndRepeatTitleFormat= "按重复%@按键";
kmSimulateKeystrokeReleaseTitleFormat= "松开按键%@";

kmSimulateModifiersPressAndReleaseTitleFormat= "键入修饰键%@";
kmSimulateModifiersPressAndHoldTitleFormat= "长按修饰键%@";
kmSimulateModifiersPressAndRepeatTitleFormat= "按下并重复修饰键%@";
kmSimulateModifiersReleaseTitleFormat= "松开修饰键%@";
kmSimulateModifiersNoModifiers= "无";


kmOpenURLTitleFormat= "打开网址：%@";
hkPauseTitleFormat= "暂停%@秒";

hkPauseUntilTitle= "暂停，直到条件满足";

kmForTitle= "对于在集合每个项目执动作作";
kmForHTMLTitle0= "对于每一不含集合会做什么";
kmForHTMLTitle1= "对于每个项目的集合执动作作";
kmForHTMLTitle2= "每个项目在这些集合执动作作";

kmForFinderSelection= "对于在Finder中选择每个路径";
kmForFolder= "对于文件夹中的每个路径";
kmClickAtFoundImage= "点击图片发现";

kmWhileTitle= "当条件满足时执动作作";
kmUntilTitle= "执行，直到条件会见动作";
kmRepeatTitle= "重复动作";
kmRepeatTitleFormat= "重复动作%@次";
kmGroupTitle= "组动作";
kmIfThenElseTitle= "如果%@执动作作";
kmIfThenElseNoConditionsTitle= "如果你不加条件会做什么";

kmSwitchHasTextDescription= "如果它有文字";
kmSwitchDoesNotHaveTextDescription= "如果它没有文本";
kmSwitchHasImageDescription= "如果有图像";
kmSwitchDoesNotHaveImageDescription= "如果它没有图片";
kmSwitchExistsDescription= "如果存在";
kmSwitchDoesNotExistDescription= "如果它不存在";
kmSwitchIsEmptyDescription= "如果它是空的";
kmSwitchIsNotEmptyDescription= "如果不是空";
kmSwitchIsDescription= "如果是“%@”";
kmSwitchIsNotDescription= "如果不是“%@”";
kmSwitchContainsDescription= "如果它包含“%@”";
kmSwitchDoesNotContainDescription= "如果它不包含“%@”";
kmSwitchMatchesDescription= "如果匹配“%@”";
kmSwitchDoesNotMatchDescription= "如果它不匹配“%@”";
kmSwitchConformsToDescription= "如果它符合“%@”";
kmSwitchDoesNotConformToDescription= "如果不符合“%@”";
kmSwitchOtherwiseDescription= "除此以外";

kAlertDefaultTitle= "键盘大师警告";
kAlertDefaultText= "你想继续执行或停下？";
hkAlertTitle= "警告‘%@’";
AlertContinueButton= "继续";
AlertStopButton= "停止";

kCommentDefaultTitle= "无标题";

hkCommentTitle= "评论‘%@’";

kGrowlDefaultTitle= "无标题";

hkGrowlTitle= "低吼‘%@’";

hkLogTitle= "登录‘%@’";

kNotificationDefaultTitle= "%ExecutingMacro%";
kNotificationDefaultSubtitle= "";
kNotificationDefaultText= "";
hkNotificationTitle= "通知‘%@’";

kUntitledButton= "好";

kQuitSpecificActionType_QuitFormat= "退出%@";
kQuitSpecificActionType_QuitRelaunchFormat= "退出并重新建%@";
kQuitSpecificActionType_ForceQuitFormat= "强制退出%@";
kQuitSpecificActionType_ForceQuitRelaunchFormat= "强制退出并重新启动%@";
kQuitSpecificTargetFrontApplication= "前端应用";

kmHideSpecificAppTitleFormat= "隐藏%@";
kmShowSpecificAppTitleFormat= "显示%@";
kmQuitSpecificAppTitleFormat= "退出%@";

kmOpenFinderSelectionTitleFormat= "在打开Finder选择%@";
kOpenFinderSelectionTargetCurrentApplication= "前端应用";

kmMoveMouseTitleFormat= "鼠标移动到（%@，%@）从%@";
kmClickMouseTitleFormat= "鼠标在（%@，%@）%@点击";
kmMoveAndClickMouseTitleFormat= "鼠标从%@移动到（%@，%@）并点击";


kmMouseTitleFormat= "%@ %@ %@";
kmMouseJustMoveTo= "到";
kmMouseClickAt= "在";
kmMouseTitleAtFormat= "(%@,%@) 相对于 %@";

kmMouseActionClick9Title= "释放%@";
kmMouseActionClick10Title= "移动鼠标";
kmMouseActionClick11Title= "单次%@";
kmMouseActionClick12Title= "双次%@";
kmMouseActionClick13Title= "三次%@";
kmMouseActionClickButton0= "点击";
kmMouseActionClickButton1= "右键点击";
kmMouseActionClickButton2= "中键点击";
kmMouseActionClickButton3= "按键4点击";
kmMouseActionClickButton4= "按键5点击";
kmMouseActionClickButton5= "按键6点击";
kmMouseActionReleaseButton0= "鼠标按钮";
kmMouseActionReleaseButton1= "右键";
kmMouseActionReleaseButton2= "中键";
kmMouseActionReleaseButton3= "按钮4";
kmMouseActionReleaseButton4= "按钮5";
kmMouseActionReleaseButton5= "按键6";
kmMouseActionAndDragTitle= "并拖动";
kmMouseActionAndHoldTitle= "并按住";
kmMouseActionMoveAndTitle= "移动到并%@";
kmMouseActionNoMoveAndTitle= "%@";
kmMouseActionScreenTitle= "主屏幕的%@";
kmMouseActionWindowTitle= "前台窗口的%@";
kmMouseActionImageTitle= "在发现图像的%@";
kmMouseActionImageFullTitle= "%在发现图像%@%@";
kmMouseActionCurrentPositionTitle= "当前鼠标位置";
kmMouseActionAbsolutePositionTitle= "绝对位置";
kmMouseActionTopLeftTitle= "左上角";
kmMouseActionTopRightTitle= "右上角";
kmMouseActionBottomLeftTitle= "左下角";
kmMouseActionBottomRightTitle= "右下角";
kmMouseActionCenterTitle= "中央";


kmUntitledMacro= "无标题宏";
kmUntitledMacroFormat= "无标题宏 %d";
kmUntitledMacroRegEx= "^无标题宏( \\d+)$";
kmUntitledMacroGroup= "无标题宏组";
kmUntitledMacroGroupFormat= "无标题宏组 %d";
kmUntitledMacroSmartGroup= "无标题智能组";
kmUntitledMacroSmartGroupFormat= "无标题智能组 %d";

kmDefaultOpenURLValue= "http://www.keyboardmaestro.com/";

hkSemaphoreLockTitle= "信号锁定";
hkSemaphoreUnlockTitle= "信号解锁";
hkSemaphoreResetTitle= "复位信号";

hkSystemActionSleepTitle= "电脑进入休眠";
hkSystemActionRestartTitle= "重新启动计算机";
hkSystemActionShutdownTitle= "关闭计算机";
hkSystemActionLogOutTitle= "登出";
hkSystemActionLoginWindowTitle= "登录窗口";
hkSystemActionOpenCloseCDROMTitle= "打开/关闭CD托盘";
hkSystemActionMuteVolumeTitle= "切换系统声音静音";
hkSystemActionIncreaseVolumeTitle= "增加系统音量";
hkSystemActionDecreaseVolumeTitle= "降低系统音量";
hkSystemActionIncreaseBrightnessTitle= "提高屏幕亮度";
hkSystemActionDecreaseBrightnessTitle= "降低屏幕亮度";
hkSystemActionActivateScreenSaverTitle= "启动屏幕保护程序";
hkSystemActionStopScreenSaverTitle= "停止屏幕保护程序";
hkSystemActionSleepDisplayTitle= "休眠屏幕";
hkSystemActionWakeDisplayTitle= "唤醒屏幕";
hkSystemActionSystemBeepTitle= "系统哔声";
hkSystemActionShowMacroPaletteTitle= "显示全局宏悬浮菜单";
hkSystemActionHideMacroPaletteTitle= "隐藏全局宏悬浮菜单";
hkSystemActionToggleMacroPaletteTitle= "拨动全局宏悬浮菜单";
hkSystemActionShowStatusMenuTitle= "显示状态菜单";
hkSystemActionClearTypedStringTitle= "清除键入字符串的缓冲区";

hkDebuggerActionStartTitle= "调试器启动";
hkDebuggerActionFinishTitle= "调试完成";
hkDebuggerActionToggleTitle= "调试器切换";
hkDebuggerActionNewMacrosPausedTitle= "调试新的宏暂停";
hkDebuggerActionNewMacrosRunTitle= "调试新的宏运行";
hkDebuggerActionBreakpointTitle= "断点调试这个宏";
hkDebuggerActionBreakpointOthersTitle= "调试器断点所有其他的宏";
hkDebuggerActionBreakpointEveryTitle= "断点调试所有宏";
hkDebuggerActionStepOverOthersTitle= "调试步骤比其他宏";
hkDebuggerActionStepIntoOthersTitle= "调试器步骤到其他宏";
hkDebuggerActionStepOutOthersTitle= "调试步骤出其他的宏";
hkDebuggerActionContinueTitle= "调试器继续这个宏";
hkDebuggerActionContinueEveryTitle= "调试器继续所有的宏";

hkPlaySoundTitle= "播放声音‘%@’";
hkPlaySoundSystemBeepTitle= "播放系统哔声";

kApplicationTargetFrontApplication= "前端应用";

kSpeakTextDefault= "动作已完成";
hkSpeakTextTitle= "朗读文本‘%@’";
hkSpeakTextVoiceTitle= "在%@率朗读文本使用语音‘%@’";
hkSpeakTextDefaultVoiceTitle= "在%@率朗读文本使用默认语音‘%@’";

hkSpeakTextDefaultRate= "默认速度";
hkSpeakTextSlowRate= "慢速";
hkSpeakTextModerateRate= "中速";
hkSpeakTextNormalRate= "常速";
hkSpeakTextQuickRate= "快速";
hkSpeakTextFastRate= "超快速";

hkSystemVolumeTitleFormat= "设置系统输出音量来%d%%";

hkSendMIDIMessageNoteOnTitleFormat= "发送MIDI通道%d注意%d速度%d";
hkSendMIDIMessageNoteOffTitleFormat= "发送MIDI通道%d注意%d关闭";
hkSendMIDIMessageControlChangeTitleFormat= "发送MIDI通道%d控制%d改为%d";

hkSendMIDIMessageNoteOnTitle= "发送MIDI音符开";
hkSendMIDIMessageNoteOffTitle= "发送MIDI音符关";
hkSendMIDIMessageControlChangeTitle= "发送MIDI控制变更";

SendMIDIMessageNoteLabel= "对于笔记";
SendMIDIMessageCCLabel= "对于控制";
SendMIDIMessageVelocityLabel= "速度为";
SendMIDIMessageValueLabel= "值为";

hkSelectMenuItemFrontAppName= "前台应用程序";

hkSelectMenuItemTitleFormat= "选择‘%@’在菜单‘%@’在应用%@中";

hkShowMenuItemTitleFormat= "显示菜单‘%@’在菜单‘%@’在应用%@中";
hkShowMenuBarItemTitleFormat= "显示菜单‘%@’在应用%@中";

hkSelectMenuItemHTMLTitleFormat= "选择菜单项在应用%@中";
hkShowMenuItemHTMLTitleFormat= "显示菜单在应用%@中";

kAddRemoveMenuItemEntryControllerTitle= "菜单标题";
kAddRemoveMenuItemEntryControllerSubmenu= "子菜单";
kAddRemoveMenuItemEntryControllerItem= "菜单项";

iTunesCmd_Untitled= "无标题";

iTunesCmd_PlayPause_Title= "播放/暂停当前曲目";
iTunesCmd_Stop_Title= "停止当前曲目";
iTunesCmd_Rewind_Title= "快退当前曲目";
iTunesCmd_FastForward_Title= "快进当前曲目";
iTunesCmd_Pause_Title= "暂停当前曲目";
iTunesCmd_NextTrack_Title= "下一曲目";
iTunesCmd_BackTrack_Title= "上一曲目";
iTunesCmd_PlayRandomTrack_Title= "播放随机曲目";

iTunesCmd_PlayNamedTrack_TitleFormat= "播放曲目‘%@’";
iTunesCmd_PlayNamedTrack_Title= "播放特定的曲目";
iTunesCmd_PlayNamedPlaylist_TitleFormat= "播放播放列表‘%@’";
iTunesCmd_PlayNamedPlaylist_Title= "播放特定的播放列表";
iTunesCmd_PlayRandomPlaylistTrack_TitleFormat= "从播放列表中播放随机曲目‘%@’";
iTunesCmd_PlayRandomPlaylistTrack_Title= "从播放列表中播放随机曲目";

iTunesCmd_IncreaseVolume_Title= "增加10%iTunes音量";
iTunesCmd_IncreaseVolume_ShortTitle= "提高iTunes音量";
iTunesCmd_DecreaseVolume_Title= "减少10%iTunes音量";
iTunesCmd_DecreaseVolume_ShortTitle= "降低iTunes音量";
iTunesCmd_SetVolume_TitleFormat= "设置iTunes音量到%d%%";
iTunesCmd_SetVolume_Title= "设置iTunes音量";

iTunesCmd_IncreaseRating_Title= "评级增加半个星";
iTunesCmd_DecreaseRating_Title= "评级下降半个星";
iTunesCmd_SetRating_TitleFormat= "设置评级为%@";
iTunesCmd_SetRating_Title= "设置评级";

QuickTimePlayerCmd_Play_Title= "播放当前电影";
QuickTimePlayerCmd_PlayPause_Title= "播放/暂停当前电影";
QuickTimePlayerCmd_Pause_Title= "暂停当前电影";

QuickTimePlayerCmd_StepForward_Title= "当前电影前进%@帧";
QuickTimePlayerCmd_StepForward_ShortTitle= "前进当前电影";
QuickTimePlayerCmd_StepBackward_Title= "当前电影后退%@帧";
QuickTimePlayerCmd_StepBackward_ShortTitle= "后退当前电影";

QuickTimePlayerCmd_IncreaseVolume_Title= "当前电影音量增加10%";
QuickTimePlayerCmd_IncreaseVolume_ShortTitle= "增加当前电影音量";
QuickTimePlayerCmd_DecreaseVolume_Title= "当前电影音量减少10%";
QuickTimePlayerCmd_DecreaseVolume_ShortTitle= "减少当前电影音量";
QuickTimePlayerCmd_SetVolume_TitleFormat= "设置当前电影音量为%d%%";
QuickTimePlayerCmd_SetVolume_Title= "设置当前电影音量";

kSafariCommandNewWindowShort= "新建%@窗口";
kSafariCommandNewWindowLong= "新建%@窗口，网址为‘%@’";
kSafariCommandNewTabShort= "新建%@标签";
kSafariCommandNewTabLong= "新建%@标签，网址为‘%@’";
kSafariCommandNextTab= "下一个%@标签";
kSafariCommandPreviousTab= "上一个%@标签";
kSafariCommandSelectTabShort= "选择%@标签";
kSafariCommandSelectTabLong= "选择%@标签‘%@’";
kSafariCommandSetTitleShort= "设置%@标题";
kSafariCommandSetTitleLong= "设置%@标题为‘%@’";
kSafariCommandClickLinkShort= "点击链接%@";
kSafariCommandClickLinkLong= "点击链接%@‘%@’";
kSafariCommandSubmitFormShort= "提交表单%@";
kSafariCommandSubmitFormLong= "提交表单%@‘%@’";
kSafariCommandResetFormShort= "重置%@表单";
kSafariCommandResetFormLong= "重置%@表单‘%@’";
kSafariCommandFocusFieldShort= "聚焦%@域";
kSafariCommandFocusFieldLong= "聚焦%@域‘%@’";
kSafariCommandSelectFieldShort= "选择%@域";
kSafariCommandSelectFieldLong= "选择%@域‘%@’";
kSafariCommandWaitForCompleteShort= "等待%@完成加载";
kSafariCommandWaitForCompleteLong= "等待%@完成加载";
kSafariCommandSetDocumentURLShort= "设置%@网址";
kSafariCommandSetDocumentURLLong= "设置%@网址为‘%@’";

aScrollWheel_ActionDescFormatUp= "模拟滚轮向上%@";
aScrollWheel_ActionDescFormatDown= "模拟滚轮向下%@";
aScrollWheel_ActionDescFormatLeft= "模拟滚轮向左%@";
aScrollWheel_ActionDescFormatRight= "模拟滚轮向右%@";

aManipulateWindow_ResizeWindowByPercentFormat= "按百分比缩放%@";
aManipulateWindow_ResizeWindowByFormat= "通过像素调整%@";
aManipulateWindow_ResizeWindowToFormat= "调整%@为像素";
aManipulateWindow_MoveWindowByFormat= "通过像素移动%@";
aManipulateWindow_MoveWindowToFormat= "移动%@定位";
aManipulateWindow_MoveAndResizeFormat= "移动和调整%@";
aManipulateWindow_CenterWindowFormat= "中心%@";
aManipulateWindow_CenterWindowAtFormat= "中心%@在位置";
aManipulateWindow_CloseWindowFormat= "关闭%@";
aManipulateWindow_ZoomWindowFormat= "放大%@";
aManipulateWindow_ReallyMinimizeWindowFormat= "最小化%@";
aManipulateWindow_UnminimizeWindowFormat= "取消最小化%@";
aManipulateWindow_MinimizeWindowFormat= "最小化%@";
aManipulateWindow_SelectWindowFormat= "把%@设为前台";

aManipulateWindow_FrontWindowName= "前台窗口";
aManipulateWindow_NamedWindowFormat= "窗口命名‘%@’";
aManipulateWindow_WindowWithNameContainingFormat = "窗口（S）随着含名称‘%@’";
aManipulateWindow_WindowWithIndexFormat= "窗口索引%@";

kmScreenCaptureTitle= "屏幕捕捉%@";
kmScreenCaptureSourceScreenMain= "屏幕捕捉主屏幕";
kmScreenCaptureSourceScreenIndex= "屏幕捕捉屏幕%@";
kmScreenCaptureSourceWindowFront= "屏幕捕捉前台窗口";
kmScreenCaptureSourceWindowIndex= "屏幕捕捉窗口%@";
kmScreenCaptureSourceWindowName= "屏幕捕捉窗口‘%@’";
kmScreenCaptureSourceWindowNameContaining= "屏幕捕捉窗口利用含名称‘%@’";
kmScreenCaptureSourceWindowNameMatching= "屏幕捕捉窗口利用名称匹配‘%@’";
kmScreenCaptureSourceWindowArea= "屏幕捕捉区域";

kHScreenAreaScreenAllDescription= "所有屏幕";
kHScreenAreaScreenMainDescription= "主屏幕";
kHScreenAreaScreenIndexDescription= "屏幕%@";
kHScreenAreaWindowFrontDescription= "前台窗口";
kHScreenAreaWindowNameDescription= "窗口‘%@’";
kHScreenAreaWindowNameContainingDescription= "窗口名称包含‘%@’";
kHScreenAreaWindowNameMatchingDescription= "窗口名称匹配‘%@’";
kHScreenAreaWindowIndexDescription= "窗口%@";
kHScreenAreaAreaDescription= "区（%@）";

kmDrawImageActionLine= "画一条线到图片";
kmDrawImageActionRectangle= "绘制一个矩形图像上";
kmDrawImageActionOval= "绘制一个椭圆形的图像上";

kmDrawImageActionHTML= "绘制到在图像%@";

kmDrawImageLineHTML= "从画一条线（%@，%@）至（%@，%@），%@厚。";
kmDrawImageRectangleHTML= "从画一个矩形（%@，%@），广%@，%@高，厚%@。";
kmDrawImageOvalHTML= "中心绘制一个椭圆（%@，%@），广%@，%@高。";

kmTransformImageActionFlipHorizontal= "水平翻转图片";
kmTransformImageActionFlipVertical= "垂直翻转图片";
kmTransformImageActionRotateCW= "顺时针旋转图片";
kmTransformImageActionRotate180= "图像旋转180°";
kmTransformImageActionRotateCCW= "旋转图像逆时针";
kmTransformImageActionFreeRotate= "旋转图像‘%@’";

kmTransformImageActionHTMLFlipHorizontal= "在%@水平翻转图片";
kmTransformImageActionHTMLFlipVertical= "翻转图像在垂直%@";
kmTransformImageActionHTMLRotateCW= "在%@顺时针旋转图像";
kmTransformImageActionHTMLRotate180= "在%@180°旋转图像";
kmTransformImageActionHTMLRotateCCW= "在%@逆时针旋转图片";
kmTransformImageActionHTMLFreeRotate= "通过‘%@’在%@旋转图像";

kmTransformImageActionFlip= "翻转图像";
kmTransformImageActionRotate= "旋转图像";

kmGetImageSize= "获取图像%@%@";

kSizeAttributePixelSize= "Pixel Size";
kSizeAttributePixelWidth= "Pixel Width";
kSizeAttributePixekHeight= "Pixel Height";
kSizeAttributePointSize= "Point Size";
kSizeAttributePointWidth= "Point Width";
kSizeAttributePointHeight= "Point Height";
kSizeAttributeDPI= "DPI";


kmResizeImageActionScaleTo= "调整图像";
kmResizeImageActionScaleToFit= "调整图像以适合";
kmResizeImageActionResizeTo= "调整画布";
kmResizeImageActionAddMargin= "添加或删除边距";
kmResizeImageActionCrop= "裁剪图片";

kmResizeImageActionHTMLScaleTo= "调整图片在%@";
kmResizeImageActionHTMLScaleToFit= "调整图片在%@";
kmResizeImageActionHTMLResizeTo= "调整画布%@";
kmResizeImageActionHTMLAddMargin= "添加或删除中的边距到图像%@";
kmResizeImageActionHTMLCrop= "裁剪图像在%@";

aInsertText_InsertTextTyping= "通过键入插入文本";
aInsertText_InsertTextPasting= "通过粘贴插入文本";
aInsertText_DisplayText= "显示文本";

aInsertText_ByTyping= "通过键入插入文本‘%@’";
aInsertText_ByPasting= "通过粘贴插入文本‘%@’";
aInsertText_ByPastingStyles= "通过粘贴插入文本样式‘%@’";
aInsertText_DisplayWindow= "显示文本‘%@’在窗口";
aInsertText_DisplayBriefly= "显示文本‘%@’简单";
aInsertText_DisplayLarge= "显示文本‘%@’大";

aInsertTextHTML_ByTyping= "通过键入插入文本";
aInsertTextHTML_ByPasting= "通过粘贴插入文本";
aInsertTextHTML_ByPastingStyles= "将通过粘贴样式文本";
aInsertTextHTML_DisplayWindow= "在窗口中显示文本";
aInsertTextHTML_DisplayBriefly= "显示文字简要";
aInsertTextHTML_DisplayLarge= "显示大文字";

aSummaryReturnFormat= "%@↩";
aSummaryTextFormat= "%@…";

aInsertText_DisplayTitle= "显示文本";
aInsertText_DisplayDescription= "该文本是：";

aFastUserSwitch_DescriptionFormat= "快速用户切换到‘%@’";

aSetKeyboardLayout_DescriptionFormat= "设置键盘布局‘%@’";

kmSimulateHardwareKeyPressAndReleaseTitleFormat= "模拟硬件密钥%@";
kmSimulateHardwareKeyPressAndHoldTitleFormat= "长按硬件密钥%@";
kmSimulateHardwareKeyPressAndRepeatTitleFormat= "按重复硬件密钥%@";
kmSimulateHardwareKeyReleaseTitleFormat= "释放硬件密钥%@";

aSetClipboardToText_Text= "文本";
aSetClipboardToText_StyledText= "样式文本";

aSetClipboardToText_DescriptionFormat= "设置为%@%@";
aSetClipboardToText_DescriptionExtendedFormat= "%@‘%@’";

aSetClipboardToText_DisplayTitle= "将剪贴板文本";
aSetClipboardToText_DisplayDescription= "剪贴板是：";

aSetVariableToText_DescriptionFormat= "设置变量‘%@’到文本‘%@’";
aSetVariableToText_HTMLFormat= "设置变量‘%@’为文本";
aSetVariableToSafariField_DescriptionFormat= "设置变量‘%@’为%@域‘%@’";
aSetVariableToSafariField_NewActionFormat= "变量设置%@域";
aSetVariableToCalculation_DescriptionFormat= "设置变量‘%@’为算式";

aSetActionDelay00_DescriptionFormat= "设置%@延时此宏%@秒";
aSetActionDelay01_DescriptionFormat= "设置%@延迟在全局范围内%@秒";
aSetActionDelay10_DescriptionFormat= "复位%@延时此宏%@秒";
aSetActionDelay11_DescriptionFormat= "复位延时%@在全局范围内%@秒";

aSetFindPasteboard_DescriptionFormat= "设置查找纸板为文本‘%@’";

aSetVariableToKeychainPassword_DescriptionFormat= "设置变量‘%@’到钥匙串密码‘%@’";
aSetKeychainPasswordToText_DescriptionFormat= "将钥匙串密码‘%@’到文本‘%@’";

aSetSafariFieldToText_DescriptionFormat= "设置%@域‘%@’为文本";
aSetSafariFieldToText_NewActionFormat= "设置%@域为文本";

aSetSafariCheckbox_DescriptionCheckedFormat= "设置%@复选框‘%@’托运";
aSetSafariCheckbox_DescriptionUncheckedFormat= "设置%@复选框‘%@’为未选中";
aSetSafariCheckbox_DescriptionValueFormat= "设置%@复选框‘%@’到‘%@’";
aSetSafariCheckbox_NewActionFormat= "设置%@复选框";

aSetSafariRadio_DescriptionFormat= "设置%@单选按钮‘%@’到‘%@’";
aSetSafariRadio_NewActionFormat= "设置%@单选按钮";

kSetMailStatus_DescriptionOnFormat = "设置邮件%@为开";
kSetMailStatus_DescriptionOffFormat = "设置邮件%@为关";
kSetMailStatus_DescriptionFormat = "设置邮件%@为%@";

kMailFlagIndex= "旗标序数";
kMailFlagged= "标志状态";
kMailJunk= "垃圾级";
kMailRead= "读状态";

kMailStatus0= "离";
kMailStatus1= "上";

kMailFlagIndex0= "没有旗标";
kMailFlagIndex1= "红色";
kMailFlagIndex2= "橘色";
kMailFlagIndex3= "黄色";
kMailFlagIndex4= "绿色";
kMailFlagIndex5= "蓝色";
kMailFlagIndex6= "紫色";
kMailFlagIndex7= "灰色";

aMailSendMessage_DescriptionFormat= "发送邮件主题为‘%@’";
aSetVariableToText_HTML= "发送邮件";

aExecuteJavaScript_NewActionFormat= "执行在JavaScript%@";

aPromptForUserInput_Format= "提示用户输入‘%@’";

hkFilterClipboardTitleFormat= "过滤%@与%@";
hkFilterVariableTitleFormat= "filter变量‘%@’与%@";

kFilterRemoveStyles= "删除样式";
kFilterMacLineEndings= "Mac的行尾";
kFilterUnixLineEndings= "Unix行结尾";
kFilterWindowsLineEndings= "Windows行结尾";
kFilterTrimWhitespace= "修剪空白";
kFilterWrap= "包";
kFilterUnwrap= "摅";
kFilterLowercase= "小写";
kFilterLowercaseFirst= "小写第一";
kFilterUppercase= "大写";
kFilterUppercaseFirst= "大写首";
kFilterCapitalize= "大写";
kFilterTitleCase= "标题案例";
kFilterSmartQuotes= "智能引号";
kFilterDumbQuotes= "傻瓜引号";
kFilterFrenchQuotes= "法国引号";
kFilterSpaces= "空间";
kFilterTabs= "标签";
kFilterEncodeHTMLEntities= "HTML编码";
kFilterEncodeNonASCIIHTMLEntities= "编码非ASCII HTML实体";
kFilterDecodeHTMLEntities= "解码HTML实体";
kFilterMakeHTMLList= "HTML列表";
kFilterPercentEncodeForURL= "百分比为编码URL";
kFilterPercentDecodeURL= "百分比解码网址";
kFilterQuoteForAppleScript= "报价的AppleScript";
kFilterQuoteForJavaScript= "报价为JavaScript";
kFilterQuoteForShellScript= "报价为Shell脚本";
kFilterQuoteForSwift= "报价为Swift";
kFilterLastPathComponent= "最后一个路径组件";
kFilterDeleteLastPathComponent= "删除最后一个路径组件";
kFilterPathExtension= "路径扩展";
kFilterDeletePathExtension= "删除路径扩展";
kFilterBaseName= "基本名称";
kFilterExpandTildeInPath= "展开波浪号在路径";
kFilterAbbreviateWithTildeInPath= "缩写随着波浪号在路径";
kFilterResolveSymlinks= "解决符号链接";
kFilterStandardizePath= "标准化路径";
kFilterZapControlCharacters= "扎普控制字符";
kFilterBulletControlCharacters= "子弹控制字符";
kFilterCalculate= "计算";
kFilterProcessTokens= "流程令牌";
kFilterValueOfNamedVariable= "命名变量值";
kFilterValueOfNamedClipboard= "命名剪贴板中的价值";
kFilterCharacterCount= "字符计数";
kFilterWordCount= "字数";
kFilterLineCount= "行数";

SearchReplaceClipboardActionType::kCaseSensitiveString= "搜索和替换%@随着字符串匹配（区分大小写）";
SearchReplaceClipboardActionType::kIgnoreCaseString= "搜索和替换%@随着字符串匹配（忽略大小写）";
SearchReplaceClipboardActionType::kCaseSensitiveRegEx= "搜索和替换%@使用正则表达式（区分大小写）";
SearchReplaceClipboardActionType::kIgnoreCaseRegEx= "搜索和替换%@使用正则表达式（忽略大小写）";

SearchReplaceVariableActionType::kCaseSensitiveString= "搜索和替换变量‘%@’随着字符串匹配（区分大小写）";
SearchReplaceVariableActionType::kIgnoreCaseString= "搜索和替换变量‘%@’随着字符串匹配（忽略大小写）";
SearchReplaceVariableActionType::kCaseSensitiveRegEx= "搜索和替换变量‘%@’使用正则表达式（区分大小写）";
SearchReplaceVariableActionType::kIgnoreCaseRegEx= "搜索和替换变量‘%@’使用正则表达式（忽略大小写）";

SearchVariableActionType::kCaseSensitiveRegEx= "搜索变量‘%@’使用正则表达式（区分大小写）";
SearchVariableActionType::kIgnoreCaseRegEx= "搜索变量‘%@’使用正则表达式（忽略大小写）";

SearchClipboardActionType::kCaseSensitiveRegEx= "搜索%@使用正则表达式（区分大小写）";
SearchClipboardActionType::kIgnoreCaseRegEx= "搜索%@使用正则表达式（忽略大小写）";

UseVariableActionType::kSetMouse= "采用变量‘%@’设置鼠标位置";
UseVariableActionType::kSetWindowPosition= "采用变量‘%@’设置前台窗口位置";
UseVariableActionType::kSetWindowSize= "采用变量‘%@’设定前台窗口口大小";
UseVariableActionType::kSetWindowFrame= "采用变量‘%@’设置前台窗口框架";
UseVariableActionType::kSetWindowByName= "采用变量‘%@’按名称设置前台窗口";
UseVariableActionType::kSetWindowByNameContains= "采用变量‘%@’按名称包含设置前台窗口";
UseVariableActionType::kSetWindowByNameMatches= "采用变量‘%@’按名称匹配设置前台窗口";
UseVariableActionType::kSetApplicationByName= "采用变量‘%@’设置由名称前申请";
UseVariableActionType::kSetApplicationByNameContains= "采用变量‘%@’设置由名称包含前端应用";
UseVariableActionType::kSetApplicationByNameMatches= "采用变量‘%@’设置按名称匹配的前端应用";
UseVariableActionType::kSetSystemVolume= "采用变量‘%@’设置系统音量";


WriteFileFormatPlainText= "纯文本";
WriteFileFormatRTF= "RTF";
WriteFileFormatRTFD= "RTFD";
WriteFileFormatSimpleText= "简单文本";
WriteFileFormatHTML= "HTML";
WriteFileFormatWebArchive= "Web档案";
WriteFileFormatWordDoc= "Word文档";
WriteFileFormatWordML= "字ML";
WriteFileFormatOfficeOpenXML= "的Office Open XML";
WriteFileFormatOpenDocument= "开放文档";
WriteFileFormatPNG= "PNG";
WriteFileFormatTIFF= "TIFF";
WriteFileFormatJPEG= "JPEG";
WriteFileFormatBMP= "BMP";
WriteFileFormatGIF= "GIF";

WriteFileEncodingMacRoman= "Mac Roman";
WriteFileEncodingLatin1= "ISO Latin 1";
WriteFileEncodingUTF8= "UTF8";
WriteFileEncodingUTF16= "UTF16";

aQuickMacro_DescriptionFormat= "录制快速宏热键%@";
aQuickMacro_TargetNameFormat= "%@[快速宏]";

aMacroGroupToggle_TargetNameFormat= "%@[宏组]";

aPressButton_DescriptionFormat= "按下按钮‘%@’";

hkSemaphoreLock_DescriptionFormat= "信号锁定‘%@’";
hkSemaphoreUnlock_DescriptionFormat= "信号解锁‘%@’";
hkSemaphoreReset_DescriptionFormat= "信号复位‘%@’";

SemaphoreUnlockFailed= "信号解锁‘%@’失败的解锁信号";

aCSMacroAction_PasteFormat= "从命名剪贴板粘贴‘%@’";
aCSMacroAction_CopyFormat= "复制到剪贴板命名‘%@’";
aCSMacroAction_CutFormat= "镜头剪切到剪贴板命名‘%@’";

aCSMacroAction_PasteTitle= "从命名剪贴板粘贴";
aCSMacroAction_CopyTitle= "复制到剪贴板命名";
aCSMacroAction_CutTitle= "剪切到剪贴板命名";

aCSMacroEditor_Paste= "从";
aCSMacroEditor_Copy= "至";
aCSMacroEditor_Cut= "至";

aACutCopyPaste_CutTitle= "剪切";
aACutCopyPaste_CopyTitle= "复制";
aACutCopyPaste_PasteTitle= "粘贴";

aSetClipboardToNamedClipboardFormat= "设置剪贴板命名剪贴板‘%@’";
aSaveClipboardToNamedClipboardFormat= "保存到剪贴板剪贴板命名‘%@’";

aSetClipboardToPastClipboardFormat= "设置%@与过去剪贴板%@";

aCopyClipboardNothing= "没有复制";
aCopyClipboard= "复制到%@%@";

aDeletePastClipboardFormat= "删除过去的剪贴板%@";

kNamedClipboardSystemClipboard= "系统剪贴板";

UnitsIn1Second= "1秒";
UnitsInSeconds= "%d秒";
UnitsIn1Minute= "1分钟";
UnitsInMinutes= "%d分钟";
UnitsIn1Hour= "1小时";
UnitsInHours= "%d小时";
UnitsIn1Day= "1天";
UnitsInDays= "%d天";

tHotKeyTriggerTitle= "热键触发";
tMIDITriggerTitle= "MIDI触发";
tUSBDeviceTriggerTitle= "USB设备触发";
tVolumeTriggerTitle= "安装的音量触发";
tFocussedWindowTriggerTitle= "聚焦窗口触发";
tFolderTriggerTitle= "文件夹触发";
tHIDTriggerTitle= "设备触发";
tTypedStringTriggerTitle= "键入字符串的触发";
tApplicationTriggerTitle= "启动应用程序";
tTimeTriggerTitle= "日触发的时间";
tWhileLoggedInTriggerTitle= "在登录触发器";
tLoginTriggerTitle= "登录触发器";
tLaunchTriggerTitle= "触发启动";
tFloatingWindowTitle= "宏悬浮菜单触发";
tStatusMenuTitle= "状态菜单触发";
tWakeTitle= "唤醒触发";
tSleepTitle= "休眠触发";
tClipboardTitle= "剪贴板触发";
tPublicWebTitle= "公用Web触发";
tScriptTitle= "脚本触发";
tWirelessNetworkTriggerTitle= "无线网络触发器";

tHotKeyTriggerDescPressedFormat= "热键%@被压";
tHotKeyTriggerDescWhileDownFormat= "当热键%@下跌";
tHotKeyTriggerDescReleasedFormat= "热键%@被释放";
tHotKeyTriggerDescTappedFormat= "热键%@被轻击";
tHotKeyTriggerDescTappedOnceFormat= "热键%@被点击一次";
tHotKeyTriggerDescTappedTwiceFormat= "热键%@被轻击两次";
tHotKeyTriggerDescTappedTimesFormat= "热键%@被轻击%d倍";

tMIDITriggerDescPressedFormat= "MIDI音符%d被压";
tMIDITriggerDescWhileDownFormat= "当MIDI音符%d下跌";
tMIDITriggerDescReleasedFormat= "MIDI音符%d被释放";

tMIDITriggerShortDescFormat= "♪%d";

tUSBTriggerAny= "任何USB设备是%%@";
tUSBTriggerNamed= "USB设备‘%@’是%%@";
tUSBTriggerContaining= "用含名称‘%@’USB设备%%@";
tUSBTriggerMatching= "与名称匹配‘%@’USB设备%%@";

tUSBTriggerAttached= "附";
tUSBTriggerDetached= "超脱";

tUSBTriggerShortDesc= "USB";

tVolumeTriggerAny= "任何数量的%%@";
tVolumeTriggerNamed= "音量‘%@’是%%@";
tVolumeTriggerContaining= "用含名称音量‘%@’是%%@";
tVolumeTriggerMatching= "与名称匹配‘%@’体积%%@";

tVolumeTriggerMounted= "加载";
tVolumeTriggerUnmounted= "推出";

tVolumeTriggerShortDesc= "💿";

tFolderTriggerAddImmediate= "任何被添加到文件夹‘%@’（立即）";
tFolderTriggerAddIgnorePartial= "任何被添加到文件夹‘%@’（忽略部分的文件）";
tFolderTriggerAddWaitCompletion= "任何被添加到文件夹‘%@’（忽略部分或更改文件）";
tFolderTriggerRemoveImmediate= "什么是从文件夹中删除‘%@’（立即）";
tFolderTriggerRemoveIgnorePartial= "什么是从文件夹中删除‘%@’（忽略部分的文件）";
tFolderTriggerRemoveWaitCompletion= "什么是从文件夹中删除‘%@’（忽略部分的文件）";
tFolderTriggerBothImmediate= "任何添加或从文件夹中删除‘%@’（立即）";
tFolderTriggerBothIgnorePartial= "任何添加或从文件夹中删除‘%@’（忽略部分的文件）";
tFolderTriggerBothWaitCompletion= "任何添加或从文件夹中删除‘%@’（忽略部分或更改文件）";

tFolderTriggerShortDesc= "📁";

tFocussedWindowFocussedWindowChanges= "聚焦的窗口变化";
tFocussedWindowFocussedWindowTitleChanges= "聚焦的窗口标题更改";
tFocussedWindowFocussedWindowsTitleChanged= "聚焦的窗口标题更改";
tFocussedWindowFocussedWindowsFrameChanged= "聚焦的窗口的框架改变";

tFocussedWindow_ShortDescription= "窗口";

tWirelessNetworkTriggerAny= "任何无线网络是%%@";
tWirelessNetworkTriggerNameIs= "无线网络‘%@’是%%@";
tWirelessNetworkTriggerNameContains= "无线网络与名称含‘%@’是%%@";
tWirelessNetworkTriggerNameMatches= "无线网络与名称匹配‘%@’是%%@";
tWirelessNetworkTriggerBSSID= "无线网络与BSSID‘%@’是%%@";

tWirelessNetworkTriggerConnected= "连接的";
tWirelessNetworkTriggerDisconnected= "断开的";

tWirelessNetworkTriggerShortDesc= "✈";

tHIDTriggerDescPressedFormat= "该%@键被按下";
tHIDTriggerDescWhileDownFormat= "当%@键被按下";
tHIDTriggerDescReleasedFormat= "该%@键被释放";
tHIDTriggerDescTappedFormat= "该%@键被轻击";
tHIDTriggerDescTappedOnceFormat= "该%@键被轻击一次";
tHIDTriggerDescTappedTwiceFormat= "该%@键被轻击两次";
tHIDTriggerDescTappedTimesFormat= "该%@键被轻击%d次";

tHIDTriggerShortDescFormat= "⚀%@";

tTypeStringTriggerDescWithoutDeleteFormat= "The %@%@ ‘%@’ is typed (no deletes)";
tTypeStringTriggerDescWithDeleteFormat= "The %@%@ ‘%@’ is typed (then deleted)";
tTypeStringSpaceShort= "◇";
tTypeStringSpaceLong= "«Space»";
tTypeStringTabShort= "⇥";
tTypeStringTabLong= "«Tab»";
tTypeStringReturnShort= "«Return»";
tTypeStringReturnLong= "↩";
tTypeStringEnterShort= "«Enter»";
tTypeStringEnterLong= "⌤";

tTypeStringExactCase= "确剪切大小写的字符串";
tTypeStringIgnoreCase= "忽略大小写的字符串";
tTypeStringRememberCase= "考虑到大小写的字符串";
tTypeStringMatch= "正则表达式";

tTypeStringNoExtra= "";
tTypeStringDiacriticalsMatterAnywhere= "";
tTypeStringDiacriticalsMatterWordBreak= " （后一个单词休息）";
tTypeStringDiacriticalsDontMatterAnywhere= " （忽略变音符）";
tTypeStringDiacriticalsDontMatterWordBreak= " （一句话休息后，忽略变音符）";

tApplicationTriggerLaunchesFormat= "应用‘%@’启动";
tApplicationTriggerActivatesFormat= "应用‘%@’激活";
tApplicationTriggerDeactivatesFormat= "应用‘%@’撤销激活";
tApplicationTriggerQuitsFormat= "应用‘%@’退出";
tApplicationTriggerWhilteActiveFormat= "当应用程序‘%@’是积极的，%@";
tApplicationTriggerWhileRunningFormat= "当应用程序‘%@’运行时，%@";

tCurrentApplicationTriggerLaunchesFormat= "任何应用程序启动";
tCurrentApplicationTriggerActivatesFormat= "任何应用程序激活";
tCurrentApplicationTriggerDeactivatesFormat= "任何应用程序撤销激活";
tCurrentApplicationTriggerQuitsFormat= "任何应用程序退出";
tCurrentApplicationTriggerWhilteActiveFormat= "当任何应用程序正在运行，%@";
tCurrentApplicationTriggerWhileRunningFormat= "当任何应用程序正在运行，%@";

tApplicationTriggerDescFormatRepeat= "repeating every %@";

tTimeTrigger_DescFormat= "在 %@ %@";
tTimeTrigger_TimeFormat= "%d:%02d";
tTimeTrigger_TimeBetweenFormat= "%d:%02d-%d:%02d";
tTimeTrigger_Login= "登录";
tTimeTrigger_LoginDescription= "在登录";
tTimeTrigger_Launch= "启动";
tTimeTrigger_LaunchDescription= "在引擎启动";
tTimeTrigger_ExecuteAyDescFormat= "在 %@ %@";
tTimeTrigger_WhileLoggedInDescFormat= "每 %@ 在 %@ %@之间";
tTimeTrigger_EveryDay= "每天";
tTimeTrigger_Weekends= "周末";
tTimeTrigger_NoDays= "无";
tTimeTrigger_WorkdaysAndWekendDays= "%@ 和 %@";
tTimeTrigger_CertainDaysFormat= "在 %@";
tTimeTrigger_WeekdayRange= "%@-%@";
tTimeTrigger_Monday= "星期一";
tTimeTrigger_Tuesday= "星期二";
tTimeTrigger_Wednesday= "星期三";
tTimeTrigger_Thursday= "星期四";
tTimeTrigger_Friday= "星期五";
tTimeTrigger_Saturday= "星期六";
tTimeTrigger_Sunday= "星期日";
tTimeTrigger_DaySep= ", ";
tTimeTrigger_RepeatingFormat= " 每天重复%d%@";

tMacroPaletteTrigger_LongDescription= "该浮动宏悬浮菜单";
tMacroPaletteTrigger_ShortDescription= "悬浮菜单";

tStatusMenuTrigger_LongDescription= "状态菜单";
tStatusMenuTrigger_ShortDescription= "菜单";

StatusMenuEmptyItem= "无活动状态菜单触发器";

StatusMenuTriggerNoStatusMenu= "这个宏将在当前已被禁用所以这个触发器将永远不会触发状态菜单中列出。";

tPublicWebTrigger_LongDescription= "通过公共Web访问";
tPublicWebTrigger_ShortDescription= "公用Web";

tScriptTrigger_LongDescription= "脚本";
tScriptTrigger_ShortDescription= "脚本";

tWakeTrigger_LongDescription= "在系统唤醒";
tWakeTrigger_ShortDescription= "唤醒";

tSleepTrigger_LongDescription= "在系统休眠";
tSleepTrigger_ShortDescription= "休眠";

tClipboardTrigger_LongDescription= "系统剪贴板变更";
tClipboardTrigger_ShortDescription= "剪贴板";

TriggerByNameFormat= "姓名搜索‘%@’";
TriggerByWebServer= "Web服务器的‘%@’";
TriggerByURLScheme= "URL方案（kmtrigger）为‘%@’";
TriggerByMacroGroupPalette= "宏设置悬浮菜单";
TriggerByDuplicateMacroPalette= "复制宏悬浮菜单";
TriggerByExecuteMacro= "执行宏";
TriggerByWhile= "当";
TriggerByDoScript= "做脚本";
TriggerByNameAction= "名称";


clRangeTitle= "编号范围集合";
clRange_LongDescription= "从%@数字来%@";
clRangeDown_LongDescription= "从%@到%@数字";

clApplicationsTitle= "运行应用程序收集";
clApplications_LongDescription= "在运行的应用程序";

clFilesTitle= "文件夹内容集合";
clFiles_LongDescription= "文件夹的内容直接‘%@’";
clFilesRecursive_LongDescription= "文件夹的内容递归‘%@’";

clFinderSelectionTitle= "Finder的Selection集合";
clFinderSelection_LongDescription= "在Finder中选择的项目";

clFoundImagesTitle= "发现图片收藏";
clFoundImages_LongDescription= "在屏幕上找到匹配的图像";

clVolumesTitle= "安装音量集";
clVolumes_LongDescription= "安装的音量";

clLinesInClipboardTitle= "行集合";
clLinesInClipboard_LongDescription= "在当前剪贴板中的行";

clLinesInTitle= "行集合";
clLinesInVariable_LongDescription= "变量‘%@’线";
clLinesInFile_LongDescription= "在文件中的行‘%@’";
clLinesInSystemClipboard_LongDescription= "在系统剪贴板的线条";
clLinesInNamedClipboard_LongDescription= "在名为剪贴板的线条‘%@’";

clSubstringsInTitle= "子在集合";
clSubstringsInVariable_LongDescription= "变量‘%@’的子串";
clSubstringsInFile_LongDescription= "在文件中的子‘%@’";
clSubstringsInSystemClipboard_LongDescription= "在系统剪贴板中的子";
clSubstringsInNamedClipboard_LongDescription= "在名为剪贴板中的子‘%@’";

clPastClipboardsTitle= "剪贴板历史录制收集";
clPastClipboards_LongDescription= "在过去的文本剪贴板";

cConditionListAnyTitle= "满足任何条件";
cConditionListAllTitle= "满足所有条件";
cConditionListNoneTitle= "不满足任何条件";
cConditionListNotAllTitle= "并非满足所有条件";

cApplicationTitle= "应用条件";
cApplication_LongDescription= "应用‘%@’%@";

cApplication_RunningDescription= "在运行";
cApplication_NotRunningDescription= "未运行";
cApplication_ActiveDescription= "是在前面";
cApplication_NotActiveDescription= "不是在前面";
cApplication_RunningButNotActiveDescription= "正在运行，但不是在前面";

cFrontWindowTitle= "前台窗口条件";

cFrontWindow_LongDescription_Exists= "前台窗口存在";
cFrontWindow_LongDescription_DoesNotExist= "前台窗口不存在";
cFrontWindow_LongDescription_TitleIs= "前台窗口的标题是‘%@’";
cFrontWindow_LongDescription_TitleIsNot= "前台窗口的标题是不是‘%@’";
cFrontWindow_LongDescription_ExistsButTitleIsNot= "前台窗口存在，但标题是不是‘%@’";
cFrontWindow_LongDescription_TitleContains= "前台窗口标题包含‘%@’";
cFrontWindow_LongDescription_TitleDoesNotContain= "前台窗口标题不包含‘%@’";
cFrontWindow_LongDescription_ExistsButTitleDoesNotContain= "前台窗口存在，但标题中不包含‘%@’";
cFrontWindow_LongDescription_TitleMatches= "前台窗口标题匹配‘%@’";
cFrontWindow_LongDescription_TitleDoesNotMatch= "前台窗口标题不符‘%@’";
cFrontWindow_LongDescription_ExistsButTitleDoesNotMatch= "前台窗口存在，但标题不符‘%@’";

cAnyWindowTitle= "任何窗口条件";

cAnyWindow_LongDescription_TitleIs= "任何窗口的标题是‘%@’";
cAnyWindow_LongDescription_TitleIsNot= "任何窗口的标题是不是‘%@’";
cAnyWindow_LongDescription_TitleContains= "任何窗口标题包含‘%@’";
cAnyWindow_LongDescription_TitleDoesNotContain= "所有窗口标题不包含‘%@’";
cAnyWindow_LongDescription_TitleMatches= "所有窗口标题匹配‘%@’";
cAnyWindow_LongDescription_TitleDoesNotMatch= "所有窗口标题不符‘%@’";

cButtonTitle= "按钮条件";

cButton_LongDescription_Exists= "按钮%@‘%@’存在";
cButton_LongDescription_DoesNotExist= "按钮%@‘%@’不存在";
cButton_LongDescription_IsEnabled= "按钮%@‘%@’启用";
cButton_LongDescription_IsNotEnabled= "按钮%@‘%@’未启用";
cButton_LongDescription_ExistsButIsNotEnabled= "按钮%@‘%@’存在，但没有启用";
cButton_LongDescription_IsOff= "按钮%@‘%@’是关闭";
cButton_LongDescription_IsOn= "按钮%@‘%@’是";
cButton_LongDescription_IsMixed= "按钮%@‘%@’混合";

cButtonSelection_Is= "与名";
cButtonSelection_Contains= "含名称";
cButtonSelection_Matches= "与姓名匹配";

cWirelessNetworkTitle= "无线网络条件";

cWirelessNetwork_AnyConnected= "任何无线网络连接";
cWirelessNetwork_AnyNotConnected= "没有无线网络连接";
cWirelessNetwork_OtherIsConnected= "无线网络%@连接";
cWirelessNetwork_OtherIsNotConnected= "无线网络%@没有连接";
cWirelessNetworkSelection_NameIs= "与名‘%@’";
cWirelessNetworkSelection_NameContains= "与包含名称‘%@’";
cWirelessNetworkSelection_NameMatches= "与姓名匹配‘%@’";
cWirelessNetworkSelection_BSSID= "与BSSID‘%@’";

cUSBDeviceTitle= "USB设备条件";

cUSBDevice_LongDescription_Exists= "USB设备%@‘%@’存在";
cUSBDevice_LongDescription_DoesNotExist= "USB设备%@‘%@’不存在";

cUSBDeviceSelection_Is= "名称为";
cUSBDeviceSelection_Contains= "名称含有";
cUSBDeviceSelection_Matches= "名称匹配";

cMenuTitle= "菜单条件";

cMenu_LongDescription_Exists= "菜单%@‘%@’存在";
cMenu_LongDescription_DoesNotExist= "菜单%@‘%@’不存在";
cMenu_LongDescription_IsEnabled= "菜单%@‘%@’启用";
cMenu_LongDescription_IsNotEnabled= "菜单%@‘%@’未启用";
cMenu_LongDescription_ExistsButIsNotEnabled= "菜单%@‘%@’存在，但没有启用";
cMenu_LongDescription_IsMarked= "菜单%@‘%@’有标记";
cMenu_LongDescription_IsNotMarked= "菜单%@‘%@’没有标记";
cMenu_LongDescription_ExistsButIsNotMarked= "菜单%@‘%@’存在，但没有标记";

cMenuSelection_Is= "与名";
cMenuSelection_Contains= "含名称";
cMenuSelection_Matches= "与姓名匹配";
cMenuSelection_Path= "与路径";
cMenuSelection_Shortcut= "用快捷键";

cModifiersTitle= "修饰键条件";

cModifiers_LongDescription_Always = "该修饰键在任何状态（总是如此）";
cModifiers_LongDescription_JustDown = "修饰键%@下降";
cModifiers_LongDescription_JustUp = "%@均达到修饰键";
cModifiers_LongDescription_Both = "%@倒塌，修饰键%@均达到";

cKeyTitle= "关键条件";

cKey_LongDescription_Down= "关键%@下跌";
cKey_LongDescription_Up= "关键%@达";

cTypedStringTitle= "键入字符串的条件";

cTypedString_LongDescriptionTitle= "键入的字符串是%@";
cTypedStringNone= "小写";
cTypedStringTitleCase= "标题案例";
cTypedStringUpperCase= "大写";

cDiskTitle= "安装的音量条件";

cDisk_LongDescription_Exists= "安装的音量%@‘%@’存在";
cDisk_LongDescription_DoesNotExist= "安装的音量%@‘%@’不存在";

cDiskSelection_Is= "与名";
cDiskSelection_Contains= "含名称";
cDiskSelection_Matches= "与姓名匹配";

cPathTitle= "路径条件";

cPath_LongDescription_NothingExists= "没有什么存在于路径‘%@’";
cPath_LongDescription_SomethingExists= "一些存在于路径‘%@’";
cPath_LongDescription_FileExists= "的文件存在于路径‘%@’";
cPath_LongDescription_FileDoesNotExists= "文件不以路径中‘%@’";
cPath_LongDescription_FolderExists= "文件夹存在于路径‘%@’";
cPath_LongDescription_FolderDoesNotExists= "一个文件夹并不在路径中‘%@’";

cClipboardTitle= "剪贴板条件";

cClipboard_LongDescription_HasText= "剪贴板有一些文字";
cClipboard_LongDescription_DoesNotHaveText= "剪贴板中没有任何文本";
cClipboard_LongDescription_HasImage= "剪贴板有图像";
cClipboard_LongDescription_DoesNotHaveImage= "剪贴板不具有图像";
cClipboard_LongDescription_Is= "剪贴板文本‘%@’";
cClipboard_LongDescription_IsNot= "剪贴板文本不是‘%@’";
cClipboard_LongDescription_Contains= "剪贴板文本包含‘%@’";
cClipboard_LongDescription_DoesNotContain= "剪贴板文本中不包含‘%@’";
cClipboard_LongDescription_Matches= "剪贴板文本匹配‘%@’";
cClipboard_LongDescription_DoesNotMatch= "剪贴板文本不匹配‘%@’";
cClipboard_LongDescription_ConformsTo= "剪贴板文本符合‘%@’";
cClipboard_LongDescription_DoesNotConformTo= "剪贴板文本不符合‘%@’";

cVariableTitle= "变量条件";

cVariable_LongDescription_Exists= "变量‘%@’存在";
cVariable_LongDescription_DoesNotExist= "变量‘%@’不存在";
cVariable_LongDescription_IsEmpty= "变量‘%@’是空的";
cVariable_LongDescription_IsNotEmpty= "变量‘%@’不为空";
cVariable_LongDescription_Is= "变量‘%@’是‘%@’";
cVariable_LongDescription_IsNot= "变量‘%@’不‘%@’";
cVariable_LongDescription_Contains= "变量‘%@’包含‘%@’";
cVariable_LongDescription_DoesNotContain= "变量‘%@’不含‘%@’";
cVariable_LongDescription_Matches= "变量‘%@’匹配‘%@’";
cVariable_LongDescription_DoesNotMatch= "变量‘%@’不匹配‘%@’";

cTextTitle= "文本条件";

cText_LongDescription_IsEmpty= "文字‘%@’是空的";
cText_LongDescription_IsNotEmpty= "文字‘%@’不为空";
cText_LongDescription_Is= "文字‘%@’是‘%@’";
cText_LongDescription_IsNot= "文字‘%@’不‘%@’";
cText_LongDescription_Contains= "文本‘%@’包含‘%@’";
cText_LongDescription_DoesNotContain= "文字‘%@’不包含‘%@’";
cText_LongDescription_Matches= "文本‘%@’比赛‘%@’";
cText_LongDescription_DoesNotMatch= "文字‘%@’不符‘%@’";

cCalculationTitle= "计算条件";
cCalculation_LongDescription= "‘%@’返回true计算（不为零）";

cMacroTitle= "宏/宏组条件";
cMacro_LongDescription= "该%@是%@";
cMacro_IsEnabled= "启用";
cMacro_IsDisabled= "未启用";
cMacro_IsActive= "活性";
cMacro_IsInactive= "待用";

cEnvironmentVariableTitle= "环境变量条件";

cEnvironmentVariable_LongDescription_Exists= "环境变量‘%@’存在";
cEnvironmentVariable_LongDescription_DoesNotExist= "环境变量‘%@’不存在";
cEnvironmentVariable_LongDescription_IsEmpty= "环境变量‘%@’是空的";
cEnvironmentVariable_LongDescription_IsNotEmpty= "环境变量‘%@’不为空";
cEnvironmentVariable_LongDescription_Is= "环境变量‘%@’是‘%@’";
cEnvironmentVariable_LongDescription_IsNot= "环境变量‘%@’不‘%@’";
cEnvironmentVariable_LongDescription_Contains= "环境变量‘%@’包含‘%@’";
cEnvironmentVariable_LongDescription_DoesNotContain= "环境变量‘%@’不含‘%@’";
cEnvironmentVariable_LongDescription_Matches= "环境变量‘%@’匹配‘%@’";
cEnvironmentVariable_LongDescription_DoesNotMatch= "环境变量‘%@’不匹配‘%@’";

cScreenImageTitle= "发现图像条件";

cScreenImage_LongDescription_Contains= "屏幕包含图像";
cScreenImage_LongDescription_ContainsUnique= "屏幕包含图像唯一";
cScreenImage_LongDescription_DoesNotContain= "屏幕不包含图像";
cScreenImage_LongDescription_DoesNotContainUnique= "屏幕不包含图像唯一";

cPixelTitle= "像素条件";

cPixel_LongDescription_Is= "在%@像素，%@是";
cPixel_LongDescription_IsNot= "在%@像素，%@是不";
cPixel_LongDescription_IsBrighter= "在%@像素，%@比亮";
cPixel_LongDescription_IsDarker= "在%@像素，%@比暗";
cPixel_LongDescription_IsMoreRed= "在%@像素，%@更红";
cPixel_LongDescription_IsLessRed= "在%@像素，%@是那么红";
cPixel_LongDescription_IsMoreGreen= "在%@像素，%@更绿";
cPixel_LongDescription_IsLessGreen= "在%@像素，%@是绿少";
cPixel_LongDescription_IsMoreBlue= "在%@像素，%@更红";
cPixel_LongDescription_IsLessBlue= "在%@像素，%@是那么红";

cLocationTitle= "区位条件";

cLocation_LongDescription_Is= "网络位置是‘%@’";
cLocation_LongDescription_IsNot= "网络位置不是‘%@’";
cLocation_LongDescription_Contains= "网络位置包含‘%@’";
cLocation_LongDescription_DoesNotContain= "网络位置不包含‘%@’";
cLocation_LongDescription_Matches= "网络位置匹配‘%@’";
cLocation_LongDescription_DoesNotMatch= "网络位置不匹配‘%@’";

cScriptTitle= "脚本条件";

cScript_LongDescription_ReturnsSuccess= "该脚本返回成功";
cScript_LongDescription_ReturnsError= "该脚本返回一个错误";
cScript_LongDescription_ReturnsStatus= "该脚本返回状态%d";
cScript_LongDescription_Is= "该脚本的结果是‘%@’";
cScript_LongDescription_IsNot= "脚本结果不‘%@’";
cScript_LongDescription_Contains= "该脚本结果包含‘%@’";
cScript_LongDescription_DoesNotContain= "脚本结果不包含‘%@’";
cScript_LongDescription_Matches= "该脚本的结果一致‘%@’";
cScript_LongDescription_DoesNotMatch= "该脚本结果不匹配‘%@’";


MacroDoActionListFormat= "执行宏‘%@’从触发%@";

ApplicationWebSiteURL= "http://www.keyboardmaestro.com/";
OnlineHelpURL= "http://documentation.keyboardmaestro.com/";
StairwaysSoftwareURL= "http://www.stairways.com/";
SupportEmailURL= "mailto:support@stairways.com?subject=Question%20About%20Keyboard%20Maestro";

SupportURL= "http://support.keyboardmaestro.com/";
QuickStartURL= "http://www.stairways.com/action/linkthru?quickstart";
RegularExpressionReferenceURL= "http://www.stairways.com/action/linkthru?regularexpressionreference";
ICUDateTimeReferenceURL= "http://www.stairways.com/action/linkthru?icudatetimereference";
RegularExpressionPropertiesReferenceURL= "http://www.stairways.com/action/linkthru?regularexpressionproperties";
WikiURL= "http://wiki.keyboardmaestro.com/";
ForumURL= "http://forum.keyboardmaestro.com/";
MacroGroupHelpURL= "http://www.stairways.com/action/linkthru?macrogrouphelp";
MacroSmartGroupHelpURL= "http://www.stairways.com/action/linkthru?smartgrouphelp";
SecureInputHelpURL= "http://www.stairways.com/action/linkthru?secureinputmode";
Early1010HelpURL= "http://www.stairways.com/action/linkthru?earlyyosemite";
WarnPrefWriteFailedHelpURL= "http://www.stairways.com/action/linkthru?prefwritefailed";

WebSeverPortError= "HTTP端口号必须为1024和65534之间的";

WebServerPortDescription= "HTTPS port is one more (%d).";
WebServerBadPortDescription= "Must be 1024-65534.  Still using %d.";


WebServerStatusDisabledDescription= "Web服务器被禁用无远程访问。";

WebServerStatusAuthention0Browser0iPhone0Clipboards0 = "Web服务器已启用，但所有访问被禁止。";
WebServerStatusAuthention0Browser0iPhone0Clipboards1 = "Web服务器是只能用于接收剪贴板启用。";
WebServerStatusAuthention0Browser1iPhone0Clipboards0 = "Web服务器启用公共才会触发。";
WebServerStatusAuthention0Browser1iPhone0Clipboards1 = "Web服务器正在为公共触发器和接收剪贴板启用。";
WebServerStatusAuthention1Browser0iPhone0Clipboards0 = "Web服务器已启用，但所有访问被禁止。";
WebServerStatusAuthention1Browser0iPhone0Clipboards1 = "Web服务器是只能用于接收剪贴板启用（用户名/密码忽略）。";
WebServerStatusAuthention1Browser0iPhone1Clipboards0 = "Web服务器正在为iOS的唯一访问启用。";
WebServerStatusAuthention1Browser0iPhone1Clipboards1 = "Web服务器正在为iOS的访问和接收剪贴板启用。";
WebServerStatusAuthention1Browser1iPhone0Clipboards0 = "Web服务器正在为公共和验证的浏览器访问启用。";
WebServerStatusAuthention1Browser1iPhone0Clipboards1 = "Web服务器是供市民及认证的访问和接收剪贴板启用。";
WebServerStatusAuthention1Browser1iPhone1Clipboards0 = "Web服务器是供市民及认证的访问和iOS访问启用。";
WebServerStatusAuthention1Browser1iPhone1Clipboards1 = "Web服务器是公开和验证和iOS访问和接收剪贴板启用。";

WebServerTriggerDisabledDescription= "或通过网络服务器，但所有远程访问被禁用。";

WebServerTriggerAuthention0Browser0iPhone0Clipboards0 = "或通过网络服务器，但所有远程访问被禁用。";
WebServerTriggerAuthention0Browser0iPhone0Clipboards1 = "或通过网络服务器，但所有远程访问被禁用。";
WebServerTriggerAuthention0Browser1iPhone0Clipboards0 = "或通过公共网络的Web服务器才会触发宏。";
WebServerTriggerAuthention0Browser1iPhone0Clipboards1 = "或通过公共网络的Web服务器才会触发宏。";
WebServerTriggerAuthention1Browser0iPhone0Clipboards0 = "或通过网络服务器，但所有远程访问被禁用。";
WebServerTriggerAuthention1Browser0iPhone0Clipboards1 = "或通过网络服务器，但所有远程访问被禁用。";
WebServerTriggerAuthention1Browser0iPhone1Clipboards0 = "或通过只iOS版访问Web服务器";
WebServerTriggerAuthention1Browser0iPhone1Clipboards1 = "或通过只iOS版访问Web服务器";
WebServerTriggerAuthention1Browser1iPhone0Clipboards0 = "或通过公共和验证的浏览器访问Web服务器";
WebServerTriggerAuthention1Browser1iPhone0Clipboards1 = "或通过公共和验证的浏览器访问Web服务器";
WebServerTriggerAuthention1Browser1iPhone1Clipboards0 = "或通过公共网络服务器，认证和iOS的访问。";
WebServerTriggerAuthention1Browser1iPhone1Clipboards1 = "或通过公共网络服务器，认证和iOS的访问。";

SendDiagnosticSendReport = "发送报告";
SendDiagnosticSendReports = "发送报告";

TimeSavedFormat= "节省时间：%@";

TimeSavedTimeFormat_None= "还没有";
TimeSavedTimeFormat_Little= "不多";
TimeSavedTimeFormat_Seconds= "%ld秒";
TimeSavedTimeFormat_Minutes= "%ld分钟";
TimeSavedTimeFormat_Hours= "%ld小时";
TimeSavedTimeFormat_Days= "%ld天";
TimeSavedTimeFormat_Months= "%ld月";
TimeSavedTimeFormat_Years= "%ld年";

TimeSavedForSwitcherMaestro= "不要浪费时间为您的应用程序四处狩猎。";

UnnamedUsername= "无名";

NoTrigger= "无";

RecordingLabel= "录制";
EnabledButton= "已启用";
EnabledToolTip= "已启用";
DisabledButton= "已禁用";
DisabledToolTip= "已禁用";

OtherHotKeyMenu= "其他…";
TypeHotKey= "按键";
ClickHotKey= "键击";

TypeHIDKey= "按下并释放";
TryAgainHIDKey= "再试一次";
ClickHIDKey= "点击";

HideActionsMenu= "隐藏动作";
ShowActionsMenu= "显示动作";



TutorialDoneButton= "完成";
TutorialOffRails1= "恐怕你已经从本教程的路径偏离，请再试一次。";
TutorialOffRails2= "恐怕你已经从本教程的路径偏离，请再试一次。";


kInstallFailed= "键盘大师安装失败，重定向到下载页面";
kDownloadCorrupted= "键盘大师下载失败，损坏的文件，重定向到下载页面";
kDownloadFailed= "键盘大师下载失败，重定向到下载页面";
FeedbackPostscript= "（我正在运行键盘大师%@，在Mac OS X%@上，并且至今为止节省了%@）";

MacroGroupNotDeleted_Title= "宏组未删除";
MacroGroupNotDeleted_DescriptionWith0MacrosAnd0MacroGroups= "没有删除，并没有删除一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith1MacrosAnd0MacroGroups= "一个宏已被删除，但未被删除的一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith2MacrosAnd0MacroGroups= "%1$d个宏被删除，但没有删除一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith0MacrosAnd1MacroGroups= "宏组已被删除，但没有删除一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith1MacrosAnd1MacroGroups= "宏组和宏被删除，但并没有删除一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith2MacrosAnd1MacroGroups= "宏组和%1$d个宏被删除，但没有删除一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith0MacrosAnd2MacroGroups= "%2$d个宏组已被删除，但没有删除一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith1MacrosAnd2MacroGroups= "%2$d个宏组和宏被删除，但并没有删除一个或多个宏组，因为它们含有未被选中的宏。";
MacroGroupNotDeleted_DescriptionWith2MacrosAnd2MacroGroups= "%2$d个宏组和%1$d个宏被删除，但没有删除一个或多个宏组，因为它们含有未被选中的宏。";

GlobalMacroGroupNotDeleted_Title= "全局宏组未删除";
GlobalMacroGroupNotDeleted_DescriptionWith0MacrosAnd0MacroGroups= "没有被删除，是不允许的全局宏组被删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith1MacrosAnd0MacroGroups= "一个宏被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith2MacrosAnd0MacroGroups= "%1$d个宏被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith0MacrosAnd1MacroGroups= "宏组已被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith1MacrosAnd1MacroGroups= "宏组和宏被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith2MacrosAnd1MacroGroups= "宏组和%1$d个宏被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith0MacrosAnd2MacroGroups= "%2$d个宏组已被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith1MacrosAnd2MacroGroups= "%2$d个宏组和宏被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";
GlobalMacroGroupNotDeleted_DescriptionWith2MacrosAnd2MacroGroups= "%2$d个宏组和%1$d个宏被删除，但不允许在全局宏组要删除（你可以改变它，如果你渴望无效）。";

kHardwareKey_SOUND_UP= "音量提升";
kHardwareKey_SOUND_DOWN= "音量降低";
kHardwareKey_BRIGHTNESS_UP= "亮度提升";
kHardwareKey_BRIGHTNESS_DOWN= "亮度降低";
kHardwareKey_CAPS_LOCK= "大写锁定";
kHardwareKey_HELP= "帮助";
kHardwareKey_POWER_KEY= "电源键";
kHardwareKey_MUTE= "静音";
kHardwareKey_NUM_LOCK= "数字键盘锁";
kHardwareKey_CONTRAST_UP= "对比度提升";
kHardwareKey_CONTRAST_DOWN= "对比度降低";
kHardwareKey_LAUNCH_PANEL= "启动面板";
kHardwareKey_EJECT= "弹出";
kHardwareKey_VIDMIRROR= "视频镜像";
kHardwareKey_PLAY= "播放";
kHardwareKey_NEXT= "下一个";
kHardwareKey_PREVIOUS= "上一个";
kHardwareKey_FAST= "快速";
kHardwareKey_REWIND= "倒带";
kHardwareKey_ILLUMINATION_UP= "夜光提升";
kHardwareKey_ILLUMINATION_DOWN= "夜光降低";
kHardwareKey_ILLUMINATION_TOGGLE= "夜光切换";

kInsertToken1 = "";
kInsertToken2 = "%Calculate%1+2%:Calculation";
kInsertToken3 = "%|%:Position Cursor (Insert Text only)";
kInsertToken4 = "Clipboard";
kInsertToken5 = "%CurrentClipboard%:Current Clipboard";
kInsertToken6 = "%PastClipboard%1%:Past Clipboard";
kInsertToken7 = "%NamedClipboard%Default Clipboard%:Named Clipboard";
kInsertToken8 = "Date";
kInsertToken9 = "%LongDate%:Long Date";
kInsertToken10 = "%ShortDate%:Short Date";
kInsertToken11 = "%NumberDate%:Number Date";
kInsertToken12 = "%LongTime%:Time With Seconds";
kInsertToken13 = "%ShortTime%:Time";
kInsertToken14 = "%ICUDateTime%EEE, MMM d, yyyy h;;;mm%:Formatted (ICU) Date Time";
kInsertToken15 = "%ICUDateTimeFor%NOW()+20%EEE, MMM d, yyyy h;;;mm%:Formatted (ICU) Date Time For";
kInsertToken16 = "%ICUDateTimePlus%3*7%Days%EEE, MMM d, yyyy h;;;mm%:Formatted (ICU) Date Time Plus";
kInsertToken17 = "%ICUDateTimeMinus%3*7%Days%EEE, MMM d, yyyy h;;;mm%:Formatted (ICU) Date Time Minus";
kInsertToken18 = "System";
kInsertToken19 = "%UserName%:User Name";
kInsertToken20 = "%UserLoginID%:User Login ID";
kInsertToken21 = "%MacName%:Machine Name";
kInsertToken22 = "%MacIPAddress%:Machine IP Address";
kInsertToken23 = "%MacUUID%:Machine Unique ID";
kInsertToken24 = "%AddressBook%Name%:AddressBook Name";
kInsertToken25 = "%AddressBook%First%:AddressBook First Name";
kInsertToken26 = "%AddressBook%Last%:AddressBook Last Name";
kInsertToken27 = "%AddressBook%Nickname%:AddressBook Nickname";
kInsertToken28 = "%AddressBook%Organization%:AddressBook Organization";
kInsertToken29 = "%AddressBook%Note%:AddressBook Note";
kInsertToken30 = "%NetworkLocation%:Network Location";
kInsertToken31 = "%WirelessNetwork%:Wireless Network Name(s)";
kInsertToken32 = "%FindPasteboard%:Find Pasteboard";
kInsertToken33 = "%Application%1%:Front Application Name";
kInsertToken34 = "%Application%2%:Last Application Name";
kInsertToken35 = "%SystemVolume%:System Volume";
kInsertToken36 = "Screen";
kInsertToken37 = "%WindowPosition%1%:Front Window Position";
kInsertToken38 = "%WindowSize%1%:Front Window Size";
kInsertToken39 = "%WindowFrame%1%:Front Window Frame";
kInsertToken40 = "%WindowName%1%:Front Window Name";
kInsertToken41 = "%CurrentMouse%:Current Mouse Location";
kInsertToken42 = "%Screen%Main%:Main Screen Frame";
kInsertToken43 = "%Screen%1%:First Screen Frame";
kInsertToken44 = "%Screen%2%:Second Screen Frame";
kInsertToken45 = "%ScreenVisible%Main%:Main Screen Visible Frame";
kInsertToken46 = "iTunes";
kInsertToken47 = "%CurrentTrack%name%:Current Track Name";
kInsertToken48 = "%CurrentTrack%artist%:Current Track Artist";
kInsertToken49 = "%CurrentTrack%album%:Current Track Album";
kInsertToken50 = "%CurrentTrack%ratingstars%:Current Track Rating";
kInsertToken51 = "Safari";
kInsertToken52 = "%SafariTitle%:Safari Document Title";
kInsertToken53 = "%SafariURL%:Safari Document URL";
kInsertToken54 = "%SafariReadyState%:Safari Ready State";
kInsertToken55 = "%SafariField%document.forms[0][0]%:Safari Field";
kInsertToken56 = "%SafariJavaScript%document.forms[0].innerHTML%:Safari JavaScript";
kInsertToken57 = "Google Chrome";
kInsertToken58 = "%ChromeTitle%:Google Chrome Document Title";
kInsertToken59 = "%ChromeURL%:Google Chrome Document URL";
kInsertToken60 = "%ChromeReadyState%:Google Chrome Ready State";
kInsertToken61 = "%ChromeField%document.forms[0][0]%:Google Chrome Field";
kInsertToken62 = "%ChromeJavaScript%document.forms[0].innerHTML%:Google Chrome JavaScript";
kInsertToken63 = "Mail";
kInsertToken64 = "%MailRecipients%:Mail Recipients";
kInsertToken65 = "%MailToRecipients%:Mail To Recipients";
kInsertToken66 = "%MailCCRecipients%:Mail CC Recipients";
kInsertToken67 = "%MailBCCRecipients%:Mail BCC Recipients";
kInsertToken68 = "%MailSender%:Mail Sender";
kInsertToken69 = "%MailReplyTo%:Mail Reply To";
kInsertToken70 = "%MailSubject%:Mail Subject";
kInsertToken71 = "%MailContents%:Mail Contents";
kInsertToken72 = "%MailRawSource%:Mail Raw Source";
kInsertToken73 = "宏信息";
kInsertToken74 = "%MacroNameForUUID%UUID%:Macro Name For UUID";
kInsertToken75 = "%ExecutingMacro%:Executing Macro";
kInsertToken76 = "%ExecutingMacroUUID%:Executing Macro UUID";
kInsertToken77 = "%ExecutingMacroGroup%:Executing Macro组";
kInsertToken78 = "%TriggerBase%:Tripped Trigger Type";
kInsertToken79 = "%Trigger%:Tripped Trigger Text";
kInsertToken80 = "%TriggerValue%:Tripped Trigger Value";
kInsertToken81 = "%ActionResult%:Success Result of Last Action";
kInsertToken82 = "###";

kInsertFunction1 = "Math";
kInsertFunction2 = "ABS(value):ABS — Absolute Value";
kInsertFunction3 = "CEIL(value):CEIL — Integer Ceiling";
kInsertFunction4 = "FLOOR(value):FLOOR — Integer Floor";
kInsertFunction5 = "TRUNC(value):TRUNC — Integer Truncated";
kInsertFunction6 = "ROUND(value):ROUND — Integer Rounded";
kInsertFunction7 = "MIN(value1,value2):MIN — Minimum";
kInsertFunction8 = "MAX(value1,value2):MAX — Maximum";
kInsertFunction9 = "SIN(value):SIN — Sine";
kInsertFunction10 = "COS(value):COS — Cosine";
kInsertFunction11 = "TAN(value):TAN — Tangent";
kInsertFunction12 = "ASIN(value):ASIN — Arcsine";
kInsertFunction13 = "ACOS(value):ACOS - Arcosine";
kInsertFunction14 = "ATAN(value):ATAN — Arctangent";
kInsertFunction15 = "ATAN2(y,x):ATAN2 — Arctangent 2";
kInsertFunction16 = "SINH(value):SINH — Hyperbolic Sine";
kInsertFunction17 = "COSH(value):COSH — Hyperbolic Cosine";
kInsertFunction18 = "TANH(value):TANH — Hyperbolic Tangenet";
kInsertFunction19 = "EXP(value):EXP — Raise e to the Power Of";
kInsertFunction20 = "LOG(value):LOG — Natural Logarithm";
kInsertFunction21 = "LOG2(value):LOG2 — Logarithm Base 2";
kInsertFunction22 = "LOG10(value):LOG10 — Logarithm Base 10";
kInsertFunction23 = "Random";
kInsertFunction24 = "RAND(value):RAND — Integer Random";
kInsertFunction25 = "RANDOM([value]):RANDOM — Random";
kInsertFunction26 = "Time";
kInsertFunction27 = "MICROSECONDS():MICROSECONDS — Since System Start";
kInsertFunction28 = "MILLISECONDS():MILLISECONDS — Fractional Since System Start";
kInsertFunction29 = "SECONDS():SECONDS — Fractional Since System Start";
kInsertFunction30 = "NOW():NOW — Seconds Since 1970 (GMT)";
kInsertFunction31 = "IDLE():IDLE — Seconds Since Last User Input";
kInsertFunction32 = "TIME([year,month,day[,hour,minute,seconds]]):TIME - Seconds Since 1970 (GMT)";
kInsertFunction33 = "TRIGGERTIME():TRIGGERTIME — Time macro was triggered, seconds Since 1970 (GMT)";
kInsertFunction34 = "Date";
kInsertFunction35 = "JD([year,month,day[,hour,minute,seconds]]):JD - Fractional Julian Date (GMT)";
kInsertFunction36 = "MJD([year,month,day[,hour,minute,seconds]]):MJD - Fractional Modified Julian Date (GMT)";
kInsertFunction37 = "TIME2JD(time):TIME2JD — Convert Unix Time to JD";
kInsertFunction38 = "TIME2MJD(time):TIME2MJD — Convert Unix Time to MJD";
kInsertFunction39 = "JD2TIME(jd):JD2TIME — Convert JD to Unix Time";
kInsertFunction40 = "JD2MJD(jd):JD2MJD — Convert JD to MJD";
kInsertFunction41 = "MJD2TIME(mjd):MJD2TIME — Convert MJD to Unix Time";
kInsertFunction42 = "MJD2JD(mjd):MJD2JD — Convert MJD to JD";
kInsertFunction43 = "YEAR([time]):YEAR - Current or Specified Year";
kInsertFunction44 = "MONTH([time]):MONTH - Current or Specified Month";
kInsertFunction45 = "DAY([time]):DAY - Current or Specified Day";
kInsertFunction46 = "DOW([time]):DOW - Current or Specified Day of the Week (Sunday=1)";
kInsertFunction47 = "HOUR([time]):HOUR - Current or Specified Hour";
kInsertFunction48 = "MINUTE([time]):MINUTE - Current or Specified Minute";
kInsertFunction49 = "SECOND([time]):SECOND - Current or Specified Second";
kInsertFunction50 = "GMTOFFSET():GMTOFFSET - Seconds from GMT";
kInsertFunction51 = "Screen";
kInsertFunction52 = "MOUSEX():MOUSEX — Mouse X Coordinate";
kInsertFunction53 = "MOUSEY():MOUSEY — Mouse Y Coordinate";
kInsertFunction54 = "MOUSEBUTTON(button):MOUSEBUTTON — Mouse Button Value";
kInsertFunction55 = "SCREEN(screen|Main|Second|Third|Internal|External|Front|Back|Mouse,Left|Right|Top|Bottom|Width|Height|MidX|MidY):SCREEN - Screen Frame Coordinate";
kInsertFunction56 = "SCREENVISIBLE(screen|Main|Second|Third|Internal|External|Front|Back|Back2|Mouse,Left|Right|Top|Bottom|Width|Height|MidX|MidY):SCREEN - Screen Visible Frame Coordinate";
kInsertFunction57 = "SCREENCOUNT():SCREENCOUNT — Screen Count";
kInsertFunction58 = "WINDOW(window,Left|Right|Top|Bottom|Width|Height|MidX|MidY):WINDOW - Window Frame Coordinate";
kInsertFunction59 = "WINDOWCOUNT():WINDOWCOUNT — Window Count";
kInsertFunction60 = "MENUBARHEIGHT():MENUBARHEIGHT — Menu Bar Height";
kInsertFunction61 = "Action Specific";
kInsertFunction62 = "IMAGE(Width|Height):IMAGE - Action Image Size";
kInsertFunction63 = "SOURCEIMAGE(Width|Height):SOURCEIMAGE - Action Source Image Size";
kInsertFunction64 = "WINDOW(Left|Right|Top|Bottom|Width|Height|MidX|MidY):WINDOW - Action Window Coordinate";
kInsertFunction65 = "LENGTH():LENGTH - Action Text Length";
kInsertFunction65 = "FONTSIZE():FONTSIZE - Action font size";
kInsertFunction66 = "Safari";
kInsertFunction67 = "SAFARITABINDEX():SAFARITABINDEX - Safari Tab Index";
kInsertFunction68 = "SAFARITABCOUNT():SAFARITABCOUNT - Safari Tab Count";
kInsertFunction69 = "SAFARIISCOMPLETE():SAFARIISCOMPLETE - Safari Is Complete";
kInsertFunction70 = "Google Chrome";
kInsertFunction71 = "CHROMETABINDEX():CHROMETABINDEX - Google Chrome Tab Index";
kInsertFunction72 = "CHROMETABCOUNT():CHROMETABCOUNT - Google Chrome Tab Count";
kInsertFunction73 = "CHROMEISCOMPLETE():CHROMEISCOMPLETE - Google Chrome Is Complete";
kInsertFunction74 = "Mail";
kInsertFunction75 = "MAILDATERECEIVED():MAILDATERECEIVED - Mail Date Received";
kInsertFunction76 = "MAILDATESENT():MAILDATESENT - Mail Date Sent";
kInsertFunction77 = "MAILFLAG():MAILFLAG - Mail Flag Index";
kInsertFunction78 = "MAILFLAGGED():MAILFLAGGED - Mail Flagged";
kInsertFunction79 = "MAILREADSTATUS():MAILREADSTATUS - Mail Read Status";
kInsertFunction80 = "MAILJUNKSTATUS():MAILJUNKSTATUS - Mail Junk Mail Status";
kInsertFunction81 = "MAILWASFORWARDED():MAILWASFORWARDED - Mail Was Forwarded";
kInsertFunction82 = "MAILWASREDIRECTED():MAILWASREDIRECTED - Mail Was Redirected";
kInsertFunction83 = "MAILWASREPLIEDTO():MAILWASREPLIEDTO - Mail Was Replied To";
kInsertFunction84 = "System";
kInsertFunction85 = "APPLICATIONS():APPLICATIONS — Application Count";
kInsertFunction86 = "BATTERY():BATTERY — Mac is on Battery Power";
kInsertFunction87 = "CLIPBOARDSEED():CLIPBOARDSEED — Clipboard Seed";
kInsertFunction88 = "ONLINE():ONLINE — Mac is Online";
kInsertFunction89 = "SCREENSAVER():SCREENSAVER — Screen Saver is Running";
kInsertFunction90 = "SYSTEMVOLUME():SYSTEMVOLUME — System Volume";
kInsertFunction91 = "SECUREINPUT():SECUREINPUT — Mac is in Secure Input Mode";
kInsertFunction92 = "CONCEALEDPALETTES():CONCEALEDPALETTES — Macro Palettes are Concealed";
kInsertFunction93 = "###";

NoPreferencePanesAvailable = "No Preference Panes Available";

NumberPadSubmenu = "Key Pad";
FunctionKeySubmenu = "功能键";

UnknownFileOrFolderName = "未知";

EnterUniCharShort= "⌤";
EnterUniCharLong= "Enter";
TabUniCharShort= "⇥";
TabUniCharLong= "Tab";
DeleteUniCharShort= "⌫";
DeleteUniCharLong= "退格";
EscapeUniCharShort= "⎋";
EscapeUniCharLong= "退出";
ClearUniCharShort= "⌧";
ClearUniCharLong= "Clear";
DeleteRightUniCharShort= "⌦";
DeleteRightUniCharLong= "删除";
ReturnUniCharShort= "↩";
ReturnUniCharLong= "回车";
SpaceUniCharShort= "空格";
SpaceUniCharLong= "空格";
PageUpUniCharShort= "⇞";
PageUpUniCharLong= "Page Up";
PageDownUniCharShort= "⇟";
PageDownUniCharLong= "Page Down";
HelpUniCharShort= "?";
HelpUniCharLong= "Help/Insert";
HomeUniCharShort= "↑";
HomeUniCharLong= "Home";
EndUniCharShort= "↓";
EndUniCharLong= "End";
LeftArrowUniCharShort= "⇠";
LeftArrowUniCharLong= "左箭头";
RightArrowUniCharShort= "⇢";
RightArrowUniCharLong= "右箭头";
DownArrowUniCharShort= "⇣";
DownArrowUniCharLong= "下箭头";
UpArrowUniCharShort= "⇡";
UpArrowUniCharLong= "上箭头";

ISOSectionUniCharShort= "§";
ISOSectionUniCharLong= "Section Sign";
JISYenUniCharShort= "¥";
JISYenUniCharLong= "JIS Yen";
JISUnderscoreUniCharShort= "Ⓙ_";
JISUnderscoreUniCharLong= "JIS Underscore";
JISKeypadCommaUniCharShort= "Ⓙ⊞,";
JISKeypadCommaUniCharLong= "JIS Key Pad ,";
JISKeypadCommaUniCharName= "JIS Key Pad Comma";
JISEisuUniCharShort= "Eisu";
JISEisuUniCharLong= "JIS Eisu";
JISKanaUniCharShort= "Kana";
JISKanaUniCharLong= "JIS Kana";

NumberPadFormatShort= "⊞%@";
NumberPadFormatLong= "Key Pad %@";

kRevisions0000_01_01= "Before Version 7";
kRevisions9999_01_01= "At Editor Launch";
kRevisions9999_01_02= "Before Last Revert";
kRevisions9999_01_03= "上次同步之前";

WidthCharacter = "↔";
HeightCharacter = "↕";
RightArrowCharacter = "→";
RightToCenterArrowCharacter = "⇥";
LeftArrowCharacter = "←";
UpArrowCharacter = "↑";
DownArrowCharacter = "↓";
DownToCenterArrowCharacter = "⤓";

kCheckLocalizedStrings= "GOOD";

MenuGlyph6F = "F1";
MenuGlyph70 = "F2";
MenuGlyph71 = "F3";
MenuGlyph72 = "F4";
MenuGlyph73 = "F5";
MenuGlyph74 = "F6";
MenuGlyph75 = "F7";
MenuGlyph76 = "F8";
MenuGlyph77 = "F9";
MenuGlyph78 = "F10";
MenuGlyph79 = "F11";
MenuGlyph7A = "F12";
MenuGlyph87 = "F13";
MenuGlyph88 = "F14";
MenuGlyph89 = "F15";
MenuGlyph8F = "F16";
MenuGlyph90 = "F17";
MenuGlyph91 = "F18";
MenuGlyph92 = "F19";

